config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-10 Sat 20:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Config</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Teddy Ma" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Config</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4ab2a75">Setup</a>
<ul>
<li><a href="#orgfdff54b">Make it easy to edit and reload this file</a></li>
<li><a href="#orgc15e3b8">Personal Information</a></li>
<li><a href="#org7b3eb18">Bootstrap use-package</a></li>
<li><a href="#org7b4c4a9">Load custom settings</a></li>
</ul>
</li>
<li><a href="#orge368480">UI</a>
<ul>
<li><a href="#org53ad54b">Reasonable default settings</a>
<ul>
<li><a href="#orgf278bbe">Y or N</a></li>
<li><a href="#org388021d">Terminal env</a></li>
<li><a href="#orgd38b544">Always follow symlinks</a></li>
<li><a href="#orge07eeb0">Alway use visual line</a></li>
<li><a href="#org2eda758">Garbage collection</a></li>
<li><a href="#orgf6a3d3b">No Visible Bell</a></li>
<li><a href="#org2c7f002">Hide UI bar</a></li>
<li><a href="#orgb6c03d3">Hide the help screen on startup</a></li>
<li><a href="#org651b78d">Highlight current line.</a></li>
<li><a href="#org863c960">Popup managment</a></li>
<li><a href="#org8ac1c4a">Disable autosave and backup</a></li>
<li><a href="#orge548bce">Auto refresh</a></li>
<li><a href="#org8662c25">Minibuffer recursive</a></li>
<li><a href="#org65f33d2">Meta Key</a></li>
<li><a href="#org2c526e3">Global UTF8</a></li>
<li><a href="#org87c403c">Cursor</a></li>
<li><a href="#orgf4064db">Display column</a></li>
</ul>
</li>
<li><a href="#orgd9d20ce">Common packages</a>
<ul>
<li><a href="#org5098700">Helpful</a></li>
<li><a href="#orgdef5c93">Restart emacs</a></li>
<li><a href="#org90643ec">Diminish</a></li>
<li><a href="#org423b7f1">Show command log</a></li>
<li><a href="#orgb9ceda1">Suggest next key</a></li>
</ul>
</li>
<li><a href="#org5f53893">Welcome dashboard</a></li>
<li><a href="#org10a133b">Winner mode</a></li>
<li><a href="#orgc84c2db">Pop win</a></li>
<li><a href="#org2d3128e">Mini frame</a></li>
<li><a href="#orga709ebe">Transpose frame</a></li>
<li><a href="#org9bc56b8">Uniquify</a></li>
</ul>
</li>
<li><a href="#org0a7f1a1">Edit</a>
<ul>
<li><a href="#orgd2988b2">Basics</a>
<ul>
<li><a href="#orgbc8dc88">CRUX</a></li>
<li><a href="#org47cc9ea">Hungry Delete</a></li>
<li><a href="#org05ee598">Trailing Whitespace</a></li>
<li><a href="#org6ba7cae">Better undo</a></li>
<li><a href="#orgc88b482">Capslock</a></li>
<li><a href="#org5010f3e">Delete region when typing</a></li>
<li><a href="#org7e9ab48">Tabs and indent</a></li>
</ul>
</li>
<li><a href="#org6ef0269">Command completion</a></li>
<li><a href="#org4a41f25">Easier selection</a></li>
<li><a href="#orge5ce3af">Toggle quotes</a></li>
<li><a href="#orgab1b903">Wrap region</a></li>
<li><a href="#org30794b5">Move line up and down</a></li>
<li><a href="#orgf08f351">Folding</a></li>
<li><a href="#org4d68a9d">Align</a></li>
<li><a href="#org6f3499a">Tab bar</a></li>
<li><a href="#org3acb888">Dired</a></li>
<li><a href="#orga64647a">Multiple cursors</a></li>
<li><a href="#orgf16e8ee">Window Navigation</a></li>
<li><a href="#orgd9b5254">Wgrep</a></li>
<li><a href="#org7f604e6">Find file in cursor</a></li>
<li><a href="#org4cba3e6">Goto line</a></li>
<li><a href="#orgd739cc9">Edit indirect</a></li>
<li><a href="#org6727716">Diff hl</a></li>
<li><a href="#org6bd8dbd">Praise the sun</a></li>
</ul>
</li>
<li><a href="#org2c7f11d">Appearance</a>
<ul>
<li><a href="#org78ffbf1">Font</a></li>
<li><a href="#org8226831">Emoji and icons</a></li>
<li><a href="#org9126a43">Mode Line</a></li>
<li><a href="#org25a7931">Theme</a></li>
<li><a href="#org0695a1e">Transparency</a></li>
<li><a href="#orgb49397b">Misc</a>
<ul>
<li><a href="#org4fd0990">Highlight Indent guides</a></li>
<li><a href="#orgb91c08e">Light follow cursor</a></li>
<li><a href="#org1ae858c">Display battery</a></li>
<li><a href="#orga29a56a">Dired icons</a></li>
<li><a href="#orgd5625d5">Info colors</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb64d312">Programming</a>
<ul>
<li><a href="#orgb96e148">LSP</a></li>
<li><a href="#org119f7b5">Interface improvements</a></li>
<li><a href="#org87c24d3">Project management</a></li>
<li><a href="#orgca5177d">Fuzzy search</a></li>
<li><a href="#orgae719dc">Deadgrep</a></li>
<li><a href="#org8d64505">Open File with Line Number</a></li>
<li><a href="#org92a388c">Jump to source</a></li>
<li><a href="#org0026bab">Git</a></li>
<li><a href="#org351eae9">Syntax checking</a></li>
<li><a href="#org8f33427">Autocomplete</a></li>
<li><a href="#org584e653">Snippets</a></li>
</ul>
</li>
<li><a href="#org2642280">Language</a>
<ul>
<li><a href="#org1e1430b">Javascript</a></li>
<li><a href="#org32f33bd">Yaml</a></li>
<li><a href="#org0069b68">Toml</a></li>
<li><a href="#org8c4f3df">Markdown</a></li>
<li><a href="#orgdb9c192">Lua</a></li>
<li><a href="#orgd975424">Haskell</a></li>
<li><a href="#orgf508138">Elixir</a></li>
<li><a href="#org8f34fc6">Ruby</a></li>
<li><a href="#orgd374a65">Rails</a></li>
<li><a href="#orga5d57c0">C</a></li>
<li><a href="#orgeec3a15">Rust</a></li>
<li><a href="#orgf1e437f">Web mode</a></li>
</ul>
</li>
<li><a href="#org6c5390f">Org</a>
<ul>
<li><a href="#org245e679">General settings.</a></li>
<li><a href="#org759ac78">Easy open common files</a></li>
<li><a href="#org984908c">Org bullets</a></li>
<li><a href="#org5df60c4">Center org buffers</a></li>
<li><a href="#org7f3c747">Task todo stages</a></li>
<li><a href="#orgd1ec5b6">Drag and drop images</a></li>
<li><a href="#org45072fd">Export</a></li>
<li><a href="#org757f488">Babel</a></li>
<li><a href="#org81b6759">Reveal.js</a></li>
<li><a href="#org9297d08">Org Tree Slide</a></li>
<li><a href="#org19eb28f">Plantuml</a></li>
<li><a href="#org324bcc6">Org Roam</a></li>
<li><a href="#orgcb5d268">Capture</a></li>
<li><a href="#org329d6a4">Agenda</a></li>
</ul>
</li>
<li><a href="#orgbadfded">Extras</a>
<ul>
<li><a href="#org202c004">Writing</a></li>
<li><a href="#org26ee7f6">Pinyin</a></li>
<li><a href="#org2e0186f">PlantUML</a></li>
<li><a href="#org430db5f">Dictionary</a></li>
<li><a href="#org24f7018">Disk Usage</a></li>
<li><a href="#orge3d465e">Shell</a></li>
</ul>
</li>
</ul>
</div>
</div>
<link id="pagestyle" rel="stylesheet" type="text/css" href="">
<script>
function swapStyle(css){
  document.getElementById('pagestyle').setAttribute('href', css);
}
</script>
<div style="margin: 1em auto; position: fixed; left: 10px; top: 0; font-size:10px; font: initial; width:100px; height: 20px; !important">
  <button style="width:100px; height: 20px; font-size:10px; font: initial; !import " onclick="swapStyle('mini.css')">
  mini
  </button>
  <button style="width:100px; height: 20px; font-size:10px; font: initial; !import" onclick="swapStyle('bootstrap.css')">
  Bootstrap
  </button>
  <button style="width:100px; height: 20px; font-size:10px; font: initial; !import" onclick="swapStyle('org.css')">
  Org
  </button>
</div>

<div id="outline-container-org4ab2a75" class="outline-2">
<h2 id="org4ab2a75">Setup</h2>
<div class="outline-text-2" id="text-org4ab2a75">
</div>
<div id="outline-container-orgfdff54b" class="outline-3">
<h3 id="orgfdff54b">Make it easy to edit and reload this file</h3>
<div class="outline-text-3" id="text-orgfdff54b">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">find-config</span> <span style="color: #a9779c;">()</span>
  <span style="color: #B08C77;">"Edit config.org"</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>find-file <span style="color: #39854C;">"~/.emacs.d/config.org"</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">find-dotfiles</span> <span style="color: #a9779c;">()</span>
  <span style="color: #B08C77;">"Edit dotfiles.org"</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>find-file <span style="color: #39854C;">"~/.emacs.d/dotfiles.org"</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">reload-config</span><span style="color: #a9779c;">()</span>
  <span style="color: #B08C77;">"Reload config.org"</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>delete-file <span style="color: #39854C;">"~/.emacs.d/config.el"</span><span style="color: #a9779c;">)</span> <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">hotfix, manually delete old config.el file</span>
  <span style="color: #a9779c;">(</span>org-babel-load-file <span style="color: #4C7A90;">(</span>expand-file-name <span style="color: #39854C;">"~/.emacs.d/config.org"</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span>global-set-key <span style="color: #a9779c;">(</span>kbd <span style="color: #39854C;">"C-c i"</span><span style="color: #a9779c;">)</span> 'find-dotfiles<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>global-set-key <span style="color: #a9779c;">(</span>kbd <span style="color: #39854C;">"C-c I"</span><span style="color: #a9779c;">)</span> 'find-config<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>global-set-key <span style="color: #a9779c;">(</span>kbd <span style="color: #39854C;">"C-c R"</span><span style="color: #a9779c;">)</span> 'reload-config<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc15e3b8" class="outline-3">
<h3 id="orgc15e3b8">Personal Information</h3>
<div class="outline-text-3" id="text-orgc15e3b8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> user-full-name <span style="color: #39854C;">"Teddy Ma"</span>
      user-mail-address <span style="color: #39854C;">"mlc880926@gmail.com"</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b3eb18" class="outline-3">
<h3 id="org7b3eb18">Bootstrap use-package</h3>
<div class="outline-text-3" id="text-org7b3eb18">
<p>
Guide about use-package <a href="https://phenix3443.github.io/notebook/emacs/modes/use-package-manual.html">https://phenix3443.github.io/notebook/emacs/modes/use-package-manual.html</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">require</span> '<span style="color: #845A84;">package</span><span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> package-archives
      '<span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"GNU ELPA"</span>     . <span style="color: #39854C;">"https://elpa.gnu.org/packages/"</span><span style="color: #4C7A90;">)</span>
        <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"MELPA Stable"</span> . <span style="color: #39854C;">"https://stable.melpa.org/packages/"</span><span style="color: #4C7A90;">)</span>
        <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"MELPA"</span>        . <span style="color: #39854C;">"https://melpa.org/packages/"</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
      package-archive-priorities
      '<span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"GNU ELPA"</span>     . 10<span style="color: #4C7A90;">)</span>
        <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"MELPA Stable"</span> . 5<span style="color: #4C7A90;">)</span>
        <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"MELPA"</span>        . 0<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>package-initialize<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> gnutls-algorithm-priority <span style="color: #39854C;">"NORMAL:-VERS-TLS1.3"</span><span style="color: #4d9391;">)</span>
<span style="color: #7c878a;">;;</span><span style="color: #7c878a;">(setq package-check-signature nil) ;; if ssl error occour, uncomment this line</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">unless</span> <span style="color: #a9779c;">(</span>package-installed-p 'use-package<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>package-refresh-contents<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>package-install 'use-package<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
