config.org
** Load custom settings
Set up the customize file to its own separate file, instead of saving customize settings in [[file:init.el][init.el]].

Warning: edit config.org file will *not* affect custom.el file!

#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file)
#+end_src

* UI
** Reasonable default settings
*** Y or N
#+begin_src emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+end_src
*** Terminal env                                                      :@os:
By default Emacs doesn't read from the same environment variables set in your terminal.
This package fixes that.
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :if (memq window-system '(mac ns))
    :ensure t
    :hook (emacs-startup . (lambda ()
                             (setq exec-path-from-shell-arguments '("-l"))
                                          ; removed the -i for faster startup
                             (exec-path-from-shell-initialize))))
#+end_src

-i gets alias definitions from =.bash_profile=
#+begin_src emacs-lisp
  (setq shell-command-switch "-ic")
#+end_src

*** Always follow symlinks
#+begin_src emacs-lisp
(setq vc-follow-symlinks t)
#+end_src
*** Alway use visual line
#+begin_src emacs-lisp
  (global-visual-line-mode 1)
#+end_src
*** Garbage collection
#+begin_src emacs-lisp
  (setq gc-cons-threshold 20000000)
#+end_src
*** No Visible Bell
#+begin_src emacs-lisp
  (setq visible-bell nil)
#+end_src
*** Hide UI bar
#+begin_src emacs-lisp
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (menu-bar-mode -1)
#+end_src

#+begin_src emacs-lisp
  (when (eq system-type 'darwin)
    (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
    (add-to-list 'default-frame-alist '(ns-appearance . dark))
    (setq ns-use-proxy-icon  nil)
    (setq frame-title-format nil)
    )
#+end_src
*** Hide the help screen on startup
#+begin_src emacs-lisp
  (setq inhibit-startup-screen t)
#+end_src
*** Highlight current line.
#+begin_src emacs-lisp
  (global-hl-line-mode 1)
#+end_src
*** Popup managment
Taken from https://emacs.stackexchange.com/questions/46210/reuse-help-window

#+begin_src emacs-lisp
  (setq display-buffer-alist
        `((,(rx bos (or "*Apropos*" "*Help*" "*helpful" "*info*" "*Summary*") (0+ not-newline))
           (display-buffer-reuse-mode-window display-buffer-below-selected)
           (window-height . 0.33)
           (mode apropos-mode help-mode helpful-mode Info-mode Man-mode))))
#+end_src
*** Disable autosave and backup
#+begin_src emacs-lisp
  (setq make-backup-file nil)
  (setq auto-save-default nil)
  (setq backup-inhibited t)
  (setq backup-directory-alist `(("." . "~/.saves")))
#+end_src

Move file to trash instead of removing.
#+begin_src emacs-lisp
  (setq-default delete-by-moving-to-trash t)
#+end_src
*** Auto refresh
#+begin_src emacs-lisp
  (global-auto-revert-mode t)
#+end_src
*** Minibuffer recursive
#+begin_src emacs-lisp
  (setq enable-recursive-minibuffers t)
#+end_src
*** Meta Key
make both command and option key to be meta key
#+begin_src emacs-lisp
  (when (eq system-type 'darwin)
    (setq mac-command-modifier 'meta
          mac-option-modifier 'meta))

  ;; (when (eq system-type 'gnu/linux)
  ;; (setq  x-meta-keysym 'super
  ;;       x-super-keysym 'meta))

#+end_src
