config.html

<div id="outline-container-org7b4c4a9" class="outline-3">
<h3 id="org7b4c4a9">Load custom settings</h3>
<div class="outline-text-3" id="text-org7b4c4a9">
<p>
Set up the customize file to its own separate file, instead of saving customize settings in <a href="init.el">init.el</a>.
Warning: edit config.org file will <b>not</b> affect custom.el file!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> custom-file <span style="color: #a9779c;">(</span>expand-file-name <span style="color: #39854C;">"custom.el"</span> user-emacs-directory<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>load custom-file<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge368480" class="outline-2">
<h2 id="orge368480">UI</h2>
<div class="outline-text-2" id="text-orge368480">
</div>
<div id="outline-container-org53ad54b" class="outline-3">
<h3 id="org53ad54b">Reasonable default settings</h3>
<div class="outline-text-3" id="text-org53ad54b">
</div>
<div id="outline-container-orgf278bbe" class="outline-4">
<h4 id="orgf278bbe">Y or N</h4>
<div class="outline-text-4" id="text-orgf278bbe">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defalias</span> '<span style="color: #4C7A90;">yes-or-no-p</span> 'y-or-n-p<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org388021d" class="outline-4">
<h4 id="org388021d">Terminal env</h4>
<div class="outline-text-4" id="text-org388021d">
<p>
By default Emacs doesn't read from the same environment variables set in your terminal. This package fixes that.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">exec-path-from-shell</span>
  <span style="color: #4C7A90;">:if</span> <span style="color: #a9779c;">(</span>memq window-system '<span style="color: #4C7A90;">(</span>mac ns<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:hook</span> <span style="color: #a9779c;">(</span>emacs-startup . <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">lambda</span> <span style="color: #787096;">()</span>
                           <span style="color: #787096;">(</span><span style="color: #1D6B69;">setq</span> exec-path-from-shell-arguments '<span style="color: #4d9391;">(</span><span style="color: #39854C;">"-l"</span><span style="color: #4d9391;">)</span><span style="color: #787096;">)</span> <span style="color: #7c878a;">; </span><span style="color: #7c878a;">removed the -i for faster startup</span>
                           <span style="color: #787096;">(</span>exec-path-from-shell-initialize<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
-i gets alias definitions from .bash<sub>profile</sub>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> shell-command-switch <span style="color: #39854C;">"-ic"</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd38b544" class="outline-4">
<h4 id="orgd38b544">Always follow symlinks</h4>
<div class="outline-text-4" id="text-orgd38b544">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> vc-follow-symlinks t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge07eeb0" class="outline-4">
<h4 id="orge07eeb0">Alway use visual line</h4>
<div class="outline-text-4" id="text-orge07eeb0">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>global-visual-line-mode 1<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2eda758" class="outline-4">
<h4 id="org2eda758">Garbage collection</h4>
<div class="outline-text-4" id="text-org2eda758">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> gc-cons-threshold 20000000<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf6a3d3b" class="outline-4">
<h4 id="orgf6a3d3b">No Visible Bell</h4>
<div class="outline-text-4" id="text-orgf6a3d3b">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> visible-bell nil<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2c7f002" class="outline-4">
<h4 id="org2c7f002">Hide UI bar</h4>
<div class="outline-text-4" id="text-org2c7f002">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>tool-bar-mode -1<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>scroll-bar-mode -1<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>menu-bar-mode -1<span style="color: #4d9391;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">when</span> <span style="color: #a9779c;">(</span>eq system-type 'darwin<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>add-to-list 'default-frame-alist '<span style="color: #4C7A90;">(</span>ns-transparent-titlebar . t<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>add-to-list 'default-frame-alist '<span style="color: #4C7A90;">(</span>ns-appearance . dark<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> ns-use-proxy-icon  nil<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> frame-title-format nil<span style="color: #a9779c;">)</span>
  <span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb6c03d3" class="outline-4">
<h4 id="orgb6c03d3">Hide the help screen on startup</h4>
<div class="outline-text-4" id="text-orgb6c03d3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> inhibit-startup-screen t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org651b78d" class="outline-4">
<h4 id="org651b78d">Highlight current line.</h4>
<div class="outline-text-4" id="text-org651b78d">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>global-hl-line-mode 1<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org863c960" class="outline-4">
<h4 id="org863c960">Popup managment</h4>
<div class="outline-text-4" id="text-org863c960">
<p>
Taken from <a href="https://emacs.stackexchange.com/questions/46210/reuse-help-window">https://emacs.stackexchange.com/questions/46210/reuse-help-window</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> display-buffer-alist
      `<span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span>,<span style="color: #787096;">(</span><span style="color: #1D6B69;">rx</span> bos <span style="color: #4d9391;">(</span><span style="color: #1D6B69;">or</span> <span style="color: #39854C;">"*Apropos*"</span> <span style="color: #39854C;">"*Help*"</span> <span style="color: #39854C;">"*helpful"</span> <span style="color: #39854C;">"*info*"</span> <span style="color: #39854C;">"*Summary*"</span><span style="color: #4d9391;">)</span> <span style="color: #4d9391;">(</span>0+ not-newline<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span>
         <span style="color: #787096;">(</span>display-buffer-reuse-mode-window display-buffer-below-selected<span style="color: #787096;">)</span>
         <span style="color: #787096;">(</span>window-height . 0.33<span style="color: #787096;">)</span>
         <span style="color: #787096;">(</span>mode apropos-mode help-mode helpful-mode Info-mode Man-mode<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8ac1c4a" class="outline-4">
<h4 id="org8ac1c4a">Disable autosave and backup</h4>
<div class="outline-text-4" id="text-org8ac1c4a">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> make-backup-file nil<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> auto-save-default nil<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> backup-inhibited t<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> backup-directory-alist `<span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"."</span> . <span style="color: #39854C;">"~/.saves"</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #7c878a;">;; </span><span style="color: #7c878a;">Move file to trash instead of removing.</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq-default</span> delete-by-moving-to-trash t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge548bce" class="outline-4">
<h4 id="orge548bce">Auto refresh</h4>
<div class="outline-text-4" id="text-orge548bce">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>global-auto-revert-mode t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8662c25" class="outline-4">
<h4 id="org8662c25">Minibuffer recursive</h4>
<div class="outline-text-4" id="text-org8662c25">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> enable-recursive-minibuffers t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org65f33d2" class="outline-4">
<h4 id="org65f33d2">Meta Key</h4>
<div class="outline-text-4" id="text-org65f33d2">
<p>
make both command and option key to be meta key
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">when</span> <span style="color: #a9779c;">(</span>eq system-type 'darwin<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> mac-command-modifier 'meta
        mac-option-modifier 'meta<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #7c878a;">;; </span><span style="color: #7c878a;">(when (eq system-type 'gnu/linux)</span>
<span style="color: #7c878a;">;; </span><span style="color: #7c878a;">(setq  x-meta-keysym 'super</span>
<span style="color: #7c878a;">;;       </span><span style="color: #7c878a;">x-super-keysym 'meta))</span>

</pre>
</div>
</div>
</div>
