config.org
*** Global UTF-8
#+begin_src emacs-lisp
  (setq locale-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
#+end_src
*** Cursor
Turn off the blinking cursor
#+begin_src emacs-lisp
  (blink-cursor-mode -1)
#+end_src
*** Display column
#+begin_src emacs-lisp
  (column-number-mode t)
#+end_src
*** remove macOS black border                                         :@os:
#+begin_src emacs-lisp
  (setq frame-resize-pixelwise t)
#+end_src

** Common packages
*** Helpful
#+begin_src emacs-lisp
  (use-package helpful
    :ensure t
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src
*** Restart emacs
#+begin_src emacs-lisp
  (use-package restart-emacs
    :ensure t)
#+end_src
*** Diminish
#+begin_src emacs-lisp
  (use-package diminish
    :ensure t)
#+end_src
*** Show command log
#+begin_src emacs-lisp
  (use-package command-log-mode
    :ensure t)
#+end_src
*** Suggest next key
Suggest next keys to me based on currently entered key combination.

#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :init
    (which-key-mode 1)
    :config
    (which-key-setup-side-window-right-bottom)
    (setq which-key-sort-order 'which-key-key-order-alpha
          which-key-side-window-max-width 0.33
          which-key-idle-delay 2
          which-key-show-early-on-C-h t
          which-key-idle-secondary-delay 0.05)
    :diminish
    which-key-mode)
#+end_src

** Welcome dashboard
#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook)
    (setq dashboard-startup-banner "~/ownCloud/Photos/emacs-banner.png")
    (setq dashboard-items '((recents  . 5)
                            (bookmarks . 5)
                            (registers . 5))))
#+end_src
** Winner mode
#+begin_src emacs-lisp
  (use-package winner-mode
    :ensure nil
    :hook (after-init . winner-mode))
#+end_src
** Pop win
#+begin_src emacs-lisp
  (use-package popwin
    :ensure t
    :config
    (global-set-key (kbd "M-p") popwin:keymap))
#+end_src
** Mini frame
Place minibuffer at the top of the current frame
#+begin_src emacs-lisp
  (use-package mini-frame
    :ensure t
    :config
    (custom-set-variables
     '(mini-frame-show-parameters
       '((top . 10)
         (width . 0.7)
         (left . 0.5)))))
#+end_src
** Transpose frame
#+begin_src emacs-lisp
  (use-package transpose-frame
    :ensure t)
#+end_src
** Uniquify
#+begin_src emacs-lisp
  (use-package uniquify
    :config
    (setq uniquify-buffer-name-style 'reverse)
    (setq uniquify-separator " • ")
    (setq uniquify-after-kill-buffer-p t)
    (setq uniquify-ignore-buffers-re "^\\*"))
#+end_src
* Edit
** Basics
