config.html
<div id="outline-container-org2c526e3" class="outline-4">
<h4 id="org2c526e3">Global UTF8</h4>
<div class="outline-text-4" id="text-org2c526e3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> locale-coding-system 'utf-8<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>set-terminal-coding-system 'utf-8<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>set-keyboard-coding-system 'utf-8<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>set-selection-coding-system 'utf-8<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>prefer-coding-system 'utf-8<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org87c403c" class="outline-4">
<h4 id="org87c403c">Cursor</h4>
<div class="outline-text-4" id="text-org87c403c">
<p>
Turn off the blinking cursor
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>blink-cursor-mode -1<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf4064db" class="outline-4">
<h4 id="orgf4064db">Display column</h4>
<div class="outline-text-4" id="text-orgf4064db">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>column-number-mode t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd9d20ce" class="outline-3">
<h3 id="orgd9d20ce">Common packages</h3>
<div class="outline-text-3" id="text-orgd9d20ce">
</div>
<div id="outline-container-org5098700" class="outline-4">
<h4 id="org5098700">Helpful</h4>
<div class="outline-text-4" id="text-org5098700">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">helpful</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:custom</span>
  <span style="color: #a9779c;">(</span>counsel-describe-function-function #'helpful-callable<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>counsel-describe-variable-function #'helpful-variable<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:bind</span>
  <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">[</span>remap describe-function<span style="color: #4C7A90;">]</span> . counsel-describe-function<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">[</span>remap describe-command<span style="color: #4C7A90;">]</span> . helpful-command<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">[</span>remap describe-variable<span style="color: #4C7A90;">]</span> . counsel-describe-variable<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">[</span>remap describe-key<span style="color: #4C7A90;">]</span> . helpful-key<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdef5c93" class="outline-4">
<h4 id="orgdef5c93">Restart emacs</h4>
<div class="outline-text-4" id="text-orgdef5c93">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">restart-emacs</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org90643ec" class="outline-4">
<h4 id="org90643ec">Diminish</h4>
<div class="outline-text-4" id="text-org90643ec">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">diminish</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org423b7f1" class="outline-4">
<h4 id="org423b7f1">Show command log</h4>
<div class="outline-text-4" id="text-org423b7f1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">command-log-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb9ceda1" class="outline-4">
<h4 id="orgb9ceda1">Suggest next key</h4>
<div class="outline-text-4" id="text-orgb9ceda1">
<p>
Suggest next keys to me based on currently entered key combination.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">which-key</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:init</span>
  <span style="color: #a9779c;">(</span>which-key-mode 1<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>which-key-setup-side-window-right-bottom<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> which-key-sort-order 'which-key-key-order-alpha
        which-key-side-window-max-width 0.33
        which-key-idle-delay 2
        which-key-show-early-on-C-h t
        which-key-idle-secondary-delay 0.05<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:diminish</span>
  which-key-mode<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5f53893" class="outline-3">
<h3 id="org5f53893">Welcome dashboard</h3>
<div class="outline-text-3" id="text-org5f53893">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">dashboard</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>dashboard-setup-startup-hook<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> dashboard-startup-banner <span style="color: #39854C;">"~/ownCloud/Photos/emacs-banner.png"</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> dashboard-items '<span style="color: #4C7A90;">(</span><span style="color: #787096;">(</span>recents  . 5<span style="color: #787096;">)</span>
                          <span style="color: #787096;">(</span>bookmarks . 5<span style="color: #787096;">)</span>
                          <span style="color: #787096;">(</span>registers . 5<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org10a133b" class="outline-3">
<h3 id="org10a133b">Winner mode</h3>
<div class="outline-text-3" id="text-org10a133b">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">winner-mode</span>
  <span style="color: #4C7A90;">:ensure</span> nil
  <span style="color: #4C7A90;">:hook</span> <span style="color: #a9779c;">(</span>after-init . winner-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc84c2db" class="outline-3">
<h3 id="orgc84c2db">Pop win</h3>
<div class="outline-text-3" id="text-orgc84c2db">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">popwin</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>global-set-key <span style="color: #4C7A90;">(</span>kbd <span style="color: #39854C;">"M-p"</span><span style="color: #4C7A90;">)</span> popwin:keymap<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d3128e" class="outline-3">
<h3 id="org2d3128e">Mini frame</h3>
<div class="outline-text-3" id="text-org2d3128e">
<p>
Place minibuffer at the top of the current frame
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">mini-frame</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>custom-set-variables
   '<span style="color: #4C7A90;">(</span>mini-frame-show-parameters
     '<span style="color: #787096;">(</span><span style="color: #4d9391;">(</span>top . 10<span style="color: #4d9391;">)</span>
       <span style="color: #4d9391;">(</span>width . 0.7<span style="color: #4d9391;">)</span>
       <span style="color: #4d9391;">(</span>left . 0.5<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga709ebe" class="outline-3">
<h3 id="orga709ebe">Transpose frame</h3>
<div class="outline-text-3" id="text-orga709ebe">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">transpose-frame</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9bc56b8" class="outline-3">
<h3 id="org9bc56b8">Uniquify</h3>
<div class="outline-text-3" id="text-org9bc56b8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">uniquify</span>
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> uniquify-buffer-name-style 'reverse<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> uniquify-separator <span style="color: #39854C;">" &#8226; "</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> uniquify-after-kill-buffer-p t<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> uniquify-ignore-buffers-re <span style="color: #39854C;">"^\\*"</span><span style="color: #a9779c;">)</span>
  <span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
</div>
