config.org
*** CRUX
=crux= is a list of useful functions.

#+begin_src emacs-lisp
  (use-package crux
    :ensure t
    :bind (("C-a" . crux-move-beginning-of-line)
           ("C-S-d" . crux-duplicate-current-line-or-region)
           ("C-c r" . crux-rename-file-and-buffer)
           ("C-c D" . crux-delete-file-and-buffer)))
#+end_src
*** Hungry Delete
hungry delete can make life easier, but emacs-smart-hungry-delete is more powerful

#+begin_src emacs-lisp
  (use-package smart-hungry-delete
    :ensure t
    :bind (("<backspace>" . smart-hungry-delete-backward-char)
           ("C-d" . smart-hungry-delete-forward-char))
    :defer nil ;; dont defer so we can add our functions to hooks
    :config (smart-hungry-delete-add-default-hooks))
#+end_src
*** Trailing Whitespace
I *never* want whitespace at the end of lines. Remove it on save.

#+begin_src emacs-lisp
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_src

*** Better undo
=undo-tree= visualises undo history as a tree for easy navigation.

#+BEGIN_SRC emacs-lisp
  (use-package undo-tree
    :ensure t
    :diminish undo-tree-mode
    :config
    (global-undo-tree-mode 1))
#+END_SRC
*** Capslock
#+begin_src emacs-lisp
  (use-package caps-lock
    :ensure t)
#+end_src
*** Delete region when typing
#+begin_src emacs-lisp
  (delete-selection-mode t)
#+end_src
*** Tabs and indent
#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
  (setq-default indicate-empty-lines t)
#+end_src

Don't count two spaces after a period as the end of a sentence.
Just one space is needed.
#+begin_src emacs-lisp
  (setq sentence-end-double-space nil)
 #+end_src
** Command completion
=ivy= is a generic completion framework which uses the minibuffer.
Turning on =ivy-mode= with fuzzy support enables replacement of lots of built in =ido= functionality.

#+begin_src emacs-lisp
  (use-package smex
    :ensure t)
  (use-package ivy
    :ensure t
    :config
    (ivy-mode t))
#+end_src

=counsel= is a collection of =ivy= enhanced versions of common Emacs commands.
I haven't bound much as =ivy-mode= takes care of most things.

#+begin_src emacs-lisp
  (use-package counsel
    :ensure t
    :bind
    (("M-x" . counsel-M-x))
    :config
     (setq ivy-re-builders-alist
           '(
             ;; no need to support fuzzy when use swiper and ivy-switch-buffer
             (ivy-switch-buffer . ivy--regex-plus)
             (swiper . ivy--regex-plus)
             (t . ivy--regex-fuzzy)
             ))
    (setq ivy-initial-inputs-alist nil))
#+end_src

=swiper= is an =ivy= enhanced version of isearch.

#+begin_src emacs-lisp
  (use-package swiper
    :ensure t
    :bind (("M-s" . swiper)))
#+end_src

=hydra= presents menus for =ivy= commands.

#+begin_src emacs-lisp
  (use-package hydra
    :ensure t)

  (use-package ivy-hydra
    :after (ivy hydra))
#+end_src

** Easier selection
=expand-region= expands the region around the cursor semantically depending on mode.
Hard to describe but a killer feature.

#+begin_src emacs-lisp
  (use-package expand-region
    :ensure t
    :bind ("C-=" . er/expand-region))
#+end_src

