config.html
<div id="outline-container-org0a7f1a1" class="outline-2">
<h2 id="org0a7f1a1">Edit</h2>
<div class="outline-text-2" id="text-org0a7f1a1">
</div>
<div id="outline-container-orgd2988b2" class="outline-3">
<h3 id="orgd2988b2">Basics</h3>
<div class="outline-text-3" id="text-orgd2988b2">
</div>
<div id="outline-container-orgbc8dc88" class="outline-4">
<h4 id="orgbc8dc88">CRUX</h4>
<div class="outline-text-4" id="text-orgbc8dc88">
<p>
<code>crux</code> is a list of useful functions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">crux</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:bind</span> <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-a"</span> . crux-move-beginning-of-line<span style="color: #4C7A90;">)</span>
         <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-S-d"</span> . crux-duplicate-current-line-or-region<span style="color: #4C7A90;">)</span>
         <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-c r"</span> . crux-rename-file-and-buffer<span style="color: #4C7A90;">)</span>
         <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-c D"</span> . crux-delete-file-and-buffer<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org47cc9ea" class="outline-4">
<h4 id="org47cc9ea">Hungry Delete</h4>
<div class="outline-text-4" id="text-org47cc9ea">
<p>
hungry delete can make life easier, but emacs-smart-hungry-delete is more powerful
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">smart-hungry-delete</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:bind</span> <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"&lt;backspace&gt;"</span> . smart-hungry-delete-backward-char<span style="color: #4C7A90;">)</span>
         <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-d"</span> . smart-hungry-delete-forward-char<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:defer</span> nil <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">dont defer so we can add our functions to hooks</span>
  <span style="color: #4C7A90;">:config</span> <span style="color: #a9779c;">(</span>smart-hungry-delete-add-default-hooks<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org05ee598" class="outline-4">
<h4 id="org05ee598">Trailing Whitespace</h4>
<div class="outline-text-4" id="text-org05ee598">
<p>
I <b>never</b> want whitespace at the end of lines. Remove it on save.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>add-hook 'before-save-hook 'delete-trailing-whitespace<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ba7cae" class="outline-4">
<h4 id="org6ba7cae">Better undo</h4>
<div class="outline-text-4" id="text-org6ba7cae">
<p>
<code>undo-tree</code> visualises undo history as a tree for easy navigation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">undo-tree</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span> undo-tree-mode
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>global-undo-tree-mode 1<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc88b482" class="outline-4">
<h4 id="orgc88b482">Capslock</h4>
<div class="outline-text-4" id="text-orgc88b482">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">caps-lock</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5010f3e" class="outline-4">
<h4 id="org5010f3e">Delete region when typing</h4>
<div class="outline-text-4" id="text-org5010f3e">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>delete-selection-mode t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7e9ab48" class="outline-4">
<h4 id="org7e9ab48">Tabs and indent</h4>
<div class="outline-text-4" id="text-org7e9ab48">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq-default</span> indent-tabs-mode nil<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq-default</span> indicate-empty-lines t<span style="color: #4d9391;">)</span>
<span style="color: #7c878a;">;; </span><span style="color: #7c878a;">Don't count two spaces after a period as the end of a sentence.</span>
<span style="color: #7c878a;">;; </span><span style="color: #7c878a;">Just one space is needed.</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> sentence-end-double-space nil<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6ef0269" class="outline-3">
<h3 id="org6ef0269">Command completion</h3>
<div class="outline-text-3" id="text-org6ef0269">
<p>
<code>ivy</code> is a generic completion framework which uses the minibuffer. Turning on <code>ivy-mode</code> with fuzzy support enables replacement of lots of built in <code>ido</code> functionality.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">smex</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">ivy</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>ivy-mode t<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
<code>counsel</code> is a collection of <code>ivy</code> enhanced versions of common Emacs commands. I haven't bound much as <code>ivy-mode</code> takes care of most things.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">counsel</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:bind</span>
  <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"M-x"</span> . counsel-M-x<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:config</span>
   <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> ivy-re-builders-alist
         '<span style="color: #4C7A90;">(</span>
           <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">no need to support fuzzy when use swiper and ivy-switch-buffer</span>
           <span style="color: #787096;">(</span>ivy-switch-buffer . ivy--regex-plus<span style="color: #787096;">)</span>
           <span style="color: #787096;">(</span>swiper . ivy--regex-plus<span style="color: #787096;">)</span>
           <span style="color: #787096;">(</span>t . ivy--regex-fuzzy<span style="color: #787096;">)</span>
           <span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> ivy-initial-inputs-alist nil<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
<code>swiper</code> is an <code>ivy</code> enhanced version of isearch.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">swiper</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:bind</span> <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"M-s"</span> . swiper<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
<code>hydra</code> presents menus for <code>ivy</code> commands.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">hydra</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">ivy-hydra</span>
  <span style="color: #4C7A90;">:after</span> <span style="color: #a9779c;">(</span>ivy hydra<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a41f25" class="outline-3">
<h3 id="org4a41f25">Easier selection</h3>
<div class="outline-text-3" id="text-org4a41f25">
<p>
<code>expand-region</code> expands the region around the cursor semantically depending on mode. Hard to describe but a killer feature.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">expand-region</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:bind</span> <span style="color: #a9779c;">(</span><span style="color: #39854C;">"C-="</span> . er/expand-region<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
