config.org
** Toggle quotes                                                   :@script:
#+begin_src emacs-lisp
  (defun toggle-quotes ()
    "Toggle single quoted string to double or vice versa, and
    flip the internal quotes as well.  Best to run on the first
    character of the string."
    (interactive)
    (save-excursion
      (re-search-backward "[\"']")
      (let* ((start (point))
             (old-c (char-after start))
             new-c)
        (setq new-c
              (case old-c
                (?\" "'")
                (?\' "\"")))
        (setq old-c (char-to-string old-c))
        (delete-char 1)
        (insert new-c)
        (re-search-forward old-c)
        (backward-char 1)
        (let ((end (point)))
          (delete-char 1)
          (insert new-c)
          (replace-string new-c old-c nil (1+ start) end)))))
#+end_src
** Wrap region
#+begin_src emacs-lisp
  (use-package wrap-region
    :ensure t
    :diminish wrap-region-mode
    :config
    (wrap-region-global-mode t)
    (wrap-region-add-wrapper "~" "~" nil 'org-mode)  ; code
    (wrap-region-add-wrapper "*" "*" nil 'org-mode)  ; bold
    (wrap-region-add-wrapper "/" "/" nil 'org-mode)  ; italic
    (wrap-region-add-wrapper "+" "+" nil 'org-mode)  ; strikethrough
    (wrap-region-add-wrapper "_" "_" nil 'org-mode)) ; verbatim
#+end_src
** Move line up and down
M-<up> M-<down> to move line up and down
#+begin_src emacs-lisp
  (use-package drag-stuff
    :ensure t
    :diminish drag-stuff-mode
    :config
    (drag-stuff-global-mode t)
    (drag-stuff-define-keys))
#+end_src
** Folding
#+begin_src emacs-lisp
  ;;https://github.com/Schnouki/dotfiles/blob/master/emacs/init-20-dev.el#L90
  (use-package origami
    :ensure t
    :commands origami-mode
    :bind (:map origami-mode-map
                ("C-: :" . origami-recursively-toggle-node)
                ("C-: a" . origami-toggle-all-nodes)
                ("C-: t" . origami-toggle-node)
                ("C-: o" . origami-show-only-node)
                ("C-: u" . origami-undo)
                ("C-: U" . origami-redo)
                ("C-: C-r" . origami-reset)
                ))
#+end_src
** Align                                                           :@script:
#+begin_src emacs-lisp
  (defun align-non-space (BEG END)
    "Align non-space columns in region BEG END."
    (interactive "r")
    (align-regexp BEG END "\\(\\s-*\\)\\S-+" 1 1 t))
#+end_src
** Tab bar
#+begin_src emacs-lisp
  (use-package centaur-tabs
    :ensure t
    :init
    (setq centaur-tabs-set-icons t)
    (setq ccentaur-tabs-set-modified-marker t
          centaur-tabs-modified-marker "M"
          centaur-tabs-cycle-scope 'tabs)
    (setq centaur-tabs-set-close-button nil)
    :config
    (centaur-tabs-group-by-projectile-project)
    )
#+end_src
