config.html

<div id="outline-container-orge5ce3af" class="outline-3">
<h3 id="orge5ce3af">Toggle quotes</h3>
<div class="outline-text-3" id="text-orge5ce3af">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">toggle-quotes</span> <span style="color: #a9779c;">()</span>
  <span style="color: #B08C77;">"Toggle single quoted string to double or vice versa, and</span>
<span style="color: #B08C77;">  flip the internal quotes as well.  Best to run on the first</span>
<span style="color: #B08C77;">  character of the string."</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">save-excursion</span>
    <span style="color: #4C7A90;">(</span>re-search-backward <span style="color: #39854C;">"[\"']"</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">let*</span> <span style="color: #787096;">(</span><span style="color: #4d9391;">(</span>start <span style="color: #a0586c;">(</span>point<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span>
           <span style="color: #4d9391;">(</span>old-c <span style="color: #a0586c;">(</span>char-after start<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span>
           new-c<span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span><span style="color: #1D6B69;">setq</span> new-c
            <span style="color: #4d9391;">(</span><span style="color: #1D6B69;">case</span> old-c
              <span style="color: #a0586c;">(</span>?\" <span style="color: #39854C;">"'"</span><span style="color: #a0586c;">)</span>
              <span style="color: #a0586c;">(</span>?\' <span style="color: #39854C;">"\""</span><span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span><span style="color: #1D6B69;">setq</span> old-c <span style="color: #4d9391;">(</span>char-to-string old-c<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span>delete-char 1<span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span>insert new-c<span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span>re-search-forward old-c<span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span>backward-char 1<span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span><span style="color: #1D6B69;">let</span> <span style="color: #4d9391;">(</span><span style="color: #a0586c;">(</span>end <span style="color: #cd9575;">(</span>point<span style="color: #cd9575;">)</span><span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span>
        <span style="color: #4d9391;">(</span>delete-char 1<span style="color: #4d9391;">)</span>
        <span style="color: #4d9391;">(</span>insert new-c<span style="color: #4d9391;">)</span>
        <span style="color: #4d9391;">(</span>replace-string new-c old-c nil <span style="color: #a0586c;">(</span>1+ start<span style="color: #a0586c;">)</span> end<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab1b903" class="outline-3">
<h3 id="orgab1b903">Wrap region</h3>
<div class="outline-text-3" id="text-orgab1b903">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">wrap-region</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span> wrap-region-mode
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>wrap-region-global-mode t<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>wrap-region-add-wrapper <span style="color: #39854C;">"~"</span> <span style="color: #39854C;">"~"</span> nil 'org-mode<span style="color: #a9779c;">)</span>  <span style="color: #7c878a;">; </span><span style="color: #7c878a;">code</span>
  <span style="color: #a9779c;">(</span>wrap-region-add-wrapper <span style="color: #39854C;">"*"</span> <span style="color: #39854C;">"*"</span> nil 'org-mode<span style="color: #a9779c;">)</span>  <span style="color: #7c878a;">; </span><span style="color: #7c878a;">bold</span>
  <span style="color: #a9779c;">(</span>wrap-region-add-wrapper <span style="color: #39854C;">"/"</span> <span style="color: #39854C;">"/"</span> nil 'org-mode<span style="color: #a9779c;">)</span>  <span style="color: #7c878a;">; </span><span style="color: #7c878a;">italic</span>
  <span style="color: #a9779c;">(</span>wrap-region-add-wrapper <span style="color: #39854C;">"+"</span> <span style="color: #39854C;">"+"</span> nil 'org-mode<span style="color: #a9779c;">)</span>  <span style="color: #7c878a;">; </span><span style="color: #7c878a;">strikethrough</span>
  <span style="color: #a9779c;">(</span>wrap-region-add-wrapper <span style="color: #39854C;">"_"</span> <span style="color: #39854C;">"_"</span> nil 'org-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span> <span style="color: #7c878a;">; </span><span style="color: #7c878a;">verbatim</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org30794b5" class="outline-3">
<h3 id="org30794b5">Move line up and down</h3>
<div class="outline-text-3" id="text-org30794b5">
<p>
M-&lt;up&gt; M-&lt;down&gt;
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">drag-stuff</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span> drag-stuff-mode
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>drag-stuff-global-mode t<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>drag-stuff-define-keys<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf08f351" class="outline-3">
<h3 id="orgf08f351">Folding</h3>
<div class="outline-text-3" id="text-orgf08f351">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #7c878a;">;;</span><span style="color: #7c878a;">https://github.com/Schnouki/dotfiles/blob/master/emacs/init-20-dev.el#L90</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">origami</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:commands</span> origami-mode
  <span style="color: #4C7A90;">:bind</span> <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">:map</span> origami-mode-map
              <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-: :"</span> . origami-recursively-toggle-node<span style="color: #4C7A90;">)</span>
              <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-: a"</span> . origami-toggle-all-nodes<span style="color: #4C7A90;">)</span>
              <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-: t"</span> . origami-toggle-node<span style="color: #4C7A90;">)</span>
              <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-: o"</span> . origami-show-only-node<span style="color: #4C7A90;">)</span>
              <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-: u"</span> . origami-undo<span style="color: #4C7A90;">)</span>
              <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-: U"</span> . origami-redo<span style="color: #4C7A90;">)</span>
              <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-: C-r"</span> . origami-reset<span style="color: #4C7A90;">)</span>
              <span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4d68a9d" class="outline-3">
<h3 id="org4d68a9d">Align</h3>
<div class="outline-text-3" id="text-org4d68a9d">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">align-non-space</span> <span style="color: #a9779c;">(</span>BEG END<span style="color: #a9779c;">)</span>
  <span style="color: #B08C77;">"Align non-space columns in region BEG END."</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">interactive</span> <span style="color: #39854C;">"r"</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>align-regexp BEG END <span style="color: #39854C;">"</span><span style="color: #39854C; font-weight: bold;">\\</span><span style="color: #39854C; font-weight: bold;">(</span><span style="color: #39854C;">\\s-*</span><span style="color: #39854C; font-weight: bold;">\\</span><span style="color: #39854C; font-weight: bold;">)</span><span style="color: #39854C;">\\S-+"</span> 1 1 t<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6f3499a" class="outline-3">
<h3 id="org6f3499a">Tab bar</h3>
<div class="outline-text-3" id="text-org6f3499a">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">centaur-tabs</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:init</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> centaur-tabs-set-icons t<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> ccentaur-tabs-set-modified-marker t
        centaur-tabs-modified-marker <span style="color: #39854C;">"M"</span>
        centaur-tabs-cycle-scope 'tabs<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> centaur-tabs-set-close-button nil<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>centaur-tabs-group-by-projectile-project<span style="color: #a9779c;">)</span>
  <span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
