config.html
<div id="outline-container-org3acb888" class="outline-3">
<h3 id="org3acb888">Dired</h3>
<div class="outline-text-3" id="text-org3acb888">
<p>
preview file
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">define-minor-mode</span> <span style="color: #4C7A90;">dired-follow-mode</span>
  <span style="color: #B08C77;">"Diplay file at point in dired after a move."</span>
  <span style="color: #4C7A90;">:lighter</span> <span style="color: #39854C;">" dired-f"</span>
  <span style="color: #4C7A90;">:global</span> t
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">if</span> dired-follow-mode <span style="color: #4C7A90;">(</span>advice-add 'dired-next-line
                                    <span style="color: #4C7A90;">:after</span> <span style="color: #787096;">(</span><span style="color: #1D6B69;">lambda</span> <span style="color: #4d9391;">(</span>arg<span style="color: #4d9391;">)</span>
                                             <span style="color: #4d9391;">(</span>dired-display-file<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span>advice-remove 'dired-next-line <span style="color: #787096;">(</span><span style="color: #1D6B69;">lambda</span> <span style="color: #4d9391;">(</span>arg<span style="color: #4d9391;">)</span>
                                      <span style="color: #4d9391;">(</span>dired-display-file<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
dired hacks
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">dired-rainbow</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">progn</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define-chmod</span> directory <span style="color: #39854C;">"#6cb2eb"</span> <span style="color: #39854C;">"d.*"</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> html <span style="color: #39854C;">"#eb5286"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"css"</span> <span style="color: #39854C;">"less"</span> <span style="color: #39854C;">"sass"</span> <span style="color: #39854C;">"scss"</span> <span style="color: #39854C;">"htm"</span> <span style="color: #39854C;">"html"</span> <span style="color: #39854C;">"jhtm"</span> <span style="color: #39854C;">"mht"</span> <span style="color: #39854C;">"eml"</span> <span style="color: #39854C;">"mustache"</span> <span style="color: #39854C;">"xhtml"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> xml <span style="color: #39854C;">"#f2d024"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"xml"</span> <span style="color: #39854C;">"xsd"</span> <span style="color: #39854C;">"xsl"</span> <span style="color: #39854C;">"xslt"</span> <span style="color: #39854C;">"wsdl"</span> <span style="color: #39854C;">"bib"</span> <span style="color: #39854C;">"json"</span> <span style="color: #39854C;">"msg"</span> <span style="color: #39854C;">"pgn"</span> <span style="color: #39854C;">"rss"</span> <span style="color: #39854C;">"yaml"</span> <span style="color: #39854C;">"yml"</span> <span style="color: #39854C;">"rdata"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> document <span style="color: #39854C;">"#9561e2"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"docm"</span> <span style="color: #39854C;">"doc"</span> <span style="color: #39854C;">"docx"</span> <span style="color: #39854C;">"odb"</span> <span style="color: #39854C;">"odt"</span> <span style="color: #39854C;">"pdb"</span> <span style="color: #39854C;">"pdf"</span> <span style="color: #39854C;">"ps"</span> <span style="color: #39854C;">"rtf"</span> <span style="color: #39854C;">"djvu"</span> <span style="color: #39854C;">"epub"</span> <span style="color: #39854C;">"odp"</span> <span style="color: #39854C;">"ppt"</span> <span style="color: #39854C;">"pptx"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> markdown <span style="color: #39854C;">"#ffed4a"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"org"</span> <span style="color: #39854C;">"etx"</span> <span style="color: #39854C;">"info"</span> <span style="color: #39854C;">"markdown"</span> <span style="color: #39854C;">"md"</span> <span style="color: #39854C;">"mkd"</span> <span style="color: #39854C;">"nfo"</span> <span style="color: #39854C;">"pod"</span> <span style="color: #39854C;">"rst"</span> <span style="color: #39854C;">"tex"</span> <span style="color: #39854C;">"textfile"</span> <span style="color: #39854C;">"txt"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> database <span style="color: #39854C;">"#6574cd"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"xlsx"</span> <span style="color: #39854C;">"xls"</span> <span style="color: #39854C;">"csv"</span> <span style="color: #39854C;">"accdb"</span> <span style="color: #39854C;">"db"</span> <span style="color: #39854C;">"mdb"</span> <span style="color: #39854C;">"sqlite"</span> <span style="color: #39854C;">"nc"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> media <span style="color: #39854C;">"#de751f"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"mp3"</span> <span style="color: #39854C;">"mp4"</span> <span style="color: #39854C;">"MP3"</span> <span style="color: #39854C;">"MP4"</span> <span style="color: #39854C;">"avi"</span> <span style="color: #39854C;">"mpeg"</span> <span style="color: #39854C;">"mpg"</span> <span style="color: #39854C;">"flv"</span> <span style="color: #39854C;">"ogg"</span> <span style="color: #39854C;">"mov"</span> <span style="color: #39854C;">"mid"</span> <span style="color: #39854C;">"midi"</span> <span style="color: #39854C;">"wav"</span> <span style="color: #39854C;">"aiff"</span> <span style="color: #39854C;">"flac"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> image <span style="color: #39854C;">"#f66d9b"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"tiff"</span> <span style="color: #39854C;">"tif"</span> <span style="color: #39854C;">"cdr"</span> <span style="color: #39854C;">"gif"</span> <span style="color: #39854C;">"ico"</span> <span style="color: #39854C;">"jpeg"</span> <span style="color: #39854C;">"jpg"</span> <span style="color: #39854C;">"png"</span> <span style="color: #39854C;">"psd"</span> <span style="color: #39854C;">"eps"</span> <span style="color: #39854C;">"svg"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> log <span style="color: #39854C;">"#c17d11"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"log"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> shell <span style="color: #39854C;">"#f6993f"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"awk"</span> <span style="color: #39854C;">"bash"</span> <span style="color: #39854C;">"bat"</span> <span style="color: #39854C;">"sed"</span> <span style="color: #39854C;">"sh"</span> <span style="color: #39854C;">"zsh"</span> <span style="color: #39854C;">"vim"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> interpreted <span style="color: #39854C;">"#38c172"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"py"</span> <span style="color: #39854C;">"ipynb"</span> <span style="color: #39854C;">"rb"</span> <span style="color: #39854C;">"pl"</span> <span style="color: #39854C;">"t"</span> <span style="color: #39854C;">"msql"</span> <span style="color: #39854C;">"mysql"</span> <span style="color: #39854C;">"pgsql"</span> <span style="color: #39854C;">"sql"</span> <span style="color: #39854C;">"r"</span> <span style="color: #39854C;">"clj"</span> <span style="color: #39854C;">"cljs"</span> <span style="color: #39854C;">"scala"</span> <span style="color: #39854C;">"js"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> compiled <span style="color: #39854C;">"#4dc0b5"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"asm"</span> <span style="color: #39854C;">"cl"</span> <span style="color: #39854C;">"lisp"</span> <span style="color: #39854C;">"el"</span> <span style="color: #39854C;">"c"</span> <span style="color: #39854C;">"h"</span> <span style="color: #39854C;">"c++"</span> <span style="color: #39854C;">"h++"</span> <span style="color: #39854C;">"hpp"</span> <span style="color: #39854C;">"hxx"</span> <span style="color: #39854C;">"m"</span> <span style="color: #39854C;">"cc"</span> <span style="color: #39854C;">"cs"</span> <span style="color: #39854C;">"cp"</span> <span style="color: #39854C;">"cpp"</span> <span style="color: #39854C;">"go"</span> <span style="color: #39854C;">"f"</span> <span style="color: #39854C;">"for"</span> <span style="color: #39854C;">"ftn"</span> <span style="color: #39854C;">"f90"</span> <span style="color: #39854C;">"f95"</span> <span style="color: #39854C;">"f03"</span> <span style="color: #39854C;">"f08"</span> <span style="color: #39854C;">"s"</span> <span style="color: #39854C;">"rs"</span> <span style="color: #39854C;">"hi"</span> <span style="color: #39854C;">"hs"</span> <span style="color: #39854C;">"pyc"</span> <span style="color: #39854C;">".java"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> executable <span style="color: #39854C;">"#8cc4ff"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"exe"</span> <span style="color: #39854C;">"msi"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> compressed <span style="color: #39854C;">"#51d88a"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"7z"</span> <span style="color: #39854C;">"zip"</span> <span style="color: #39854C;">"bz2"</span> <span style="color: #39854C;">"tgz"</span> <span style="color: #39854C;">"txz"</span> <span style="color: #39854C;">"gz"</span> <span style="color: #39854C;">"xz"</span> <span style="color: #39854C;">"z"</span> <span style="color: #39854C;">"Z"</span> <span style="color: #39854C;">"jar"</span> <span style="color: #39854C;">"war"</span> <span style="color: #39854C;">"ear"</span> <span style="color: #39854C;">"rar"</span> <span style="color: #39854C;">"sar"</span> <span style="color: #39854C;">"xpi"</span> <span style="color: #39854C;">"apk"</span> <span style="color: #39854C;">"xz"</span> <span style="color: #39854C;">"tar"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> packaged <span style="color: #39854C;">"#faad63"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"deb"</span> <span style="color: #39854C;">"rpm"</span> <span style="color: #39854C;">"apk"</span> <span style="color: #39854C;">"jad"</span> <span style="color: #39854C;">"jar"</span> <span style="color: #39854C;">"cab"</span> <span style="color: #39854C;">"pak"</span> <span style="color: #39854C;">"pk3"</span> <span style="color: #39854C;">"vdf"</span> <span style="color: #39854C;">"vpk"</span> <span style="color: #39854C;">"bsp"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> encrypted <span style="color: #39854C;">"#ffed4a"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"gpg"</span> <span style="color: #39854C;">"pgp"</span> <span style="color: #39854C;">"asc"</span> <span style="color: #39854C;">"bfe"</span> <span style="color: #39854C;">"enc"</span> <span style="color: #39854C;">"signature"</span> <span style="color: #39854C;">"sig"</span> <span style="color: #39854C;">"p12"</span> <span style="color: #39854C;">"pem"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> fonts <span style="color: #39854C;">"#6cb2eb"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"afm"</span> <span style="color: #39854C;">"fon"</span> <span style="color: #39854C;">"fnt"</span> <span style="color: #39854C;">"pfb"</span> <span style="color: #39854C;">"pfm"</span> <span style="color: #39854C;">"ttf"</span> <span style="color: #39854C;">"otf"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> partition <span style="color: #39854C;">"#e3342f"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"dmg"</span> <span style="color: #39854C;">"iso"</span> <span style="color: #39854C;">"bin"</span> <span style="color: #39854C;">"nrg"</span> <span style="color: #39854C;">"qcow"</span> <span style="color: #39854C;">"toast"</span> <span style="color: #39854C;">"vcd"</span> <span style="color: #39854C;">"vmdk"</span> <span style="color: #39854C;">"bak"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define</span> vc <span style="color: #39854C;">"#0074d9"</span> <span style="color: #787096;">(</span><span style="color: #39854C;">"git"</span> <span style="color: #39854C;">"gitignore"</span> <span style="color: #39854C;">"gitattributes"</span> <span style="color: #39854C;">"gitmodules"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">dired-rainbow-define-chmod</span> executable-unix <span style="color: #39854C;">"#38c172"</span> <span style="color: #39854C;">"-.*x.*"</span><span style="color: #4C7A90;">)</span>
    <span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
