config.org
** Multiple cursors
#+begin_src emacs-lisp
  (use-package iedit
    :ensure t)
  (use-package multiple-cursors
    :ensure t
    :config
    (global-unset-key (kbd "M-<down-mouse-1>"))
    (global-set-key (kbd "M-<mouse-1>") 'mc/add-cursor-on-click)
    (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
    (global-set-key (kbd "C->") 'mc/mark-next-like-this)
    (global-set-key (kbd "C-<") 'mc/mark-previous-like-this))
#+end_src
** Window Navigation
#+begin_src emacs-lisp
  (use-package ace-window
    :ensure t
    :config
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground :height 5.0)))))
    :bind
    ("M-o" . ace-window))
#+end_src
** Wgrep
wgrep allows you to edit a grep buffer and apply those changes to the file buffer like sed interactively.
No need to learn sed script, just learn Emacs.
#+begin_src emacs-lisp
  (use-package wgrep
    :ensure t)
#+end_src
** Find file in cursor                                             :@script:
#+begin_src emacs-lisp
  (defun teddy-ma/find-file-under-cursor ()
    "Check it the filepath under cursor is an absolute path otherwise open helm and insert the filepath."
    (interactive)
    (let ((file-path (thing-at-point 'filename t)))
      (if (file-name-absolute-p file-path)
          (find-file-at-point file-path)
        (minibuffer-with-setup-hook (lambda ()
                                      (insert file-path))
          (helm-ls-git-ls)))))
#+end_src
** Goto line                                                       :@script:
Temporarily display line number when call go to line function
#+begin_src emacs-lisp
  (global-set-key [remap goto-line] 'goto-line-with-feedback)

  (defun goto-line-with-feedback ()
    "Show line numbers temporarily, while prompting for the line number input"
    (interactive)
    (unwind-protect
        (progn
          (display-line-numbers-mode 1)
          (goto-line (read-number "Goto line: ")))
      (display-line-numbers-mode -1)))
#+end_src
but avy-goto-line is awesome too
** Edit indirect
like buffer narrow but in other buffer
#+begin_src emacs-lisp
  (use-package edit-indirect
    :ensure t)
#+end_src
** Diff hl
#+begin_src emacs-lisp
  (use-package diff-hl
    :ensure t
    :hook
    ((magit-pre-refresh . diff-hl-magit-pre-refresh)
     (magit-post-refresh . diff-hl-magit-post-refresh))
    :init
    (setq diff-hl-draw-borders nil)
    ;; (setq diff-hl-global-modes '(not org-mode))
    ;; (setq diff-hl-fringe-bmp-function 'diff-hl-fringe-bmp-from-type)
    ;; (setq diff-hl-global-modes (not '(image-mode org-mode)))
    :config
    (global-diff-hl-mode)
    )
#+end_src
** Praise the sun
#+begin_src emacs-lisp
  (use-package solaire-mode
    :ensure t
    :hook (after-init . solaire-global-mode))
#+end_src
* Appearance
