config.html
<div id="outline-container-orga64647a" class="outline-3">
<h3 id="orga64647a">Multiple cursors</h3>
<div class="outline-text-3" id="text-orga64647a">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">iedit</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">multiple-cursors</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>global-unset-key <span style="color: #4C7A90;">(</span>kbd <span style="color: #39854C;">"M-&lt;down-mouse-1&gt;"</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>global-set-key <span style="color: #4C7A90;">(</span>kbd <span style="color: #39854C;">"M-&lt;mouse-1&gt;"</span><span style="color: #4C7A90;">)</span> 'mc/add-cursor-on-click<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>global-set-key <span style="color: #4C7A90;">(</span>kbd <span style="color: #39854C;">"C-S-c C-S-c"</span><span style="color: #4C7A90;">)</span> 'mc/edit-lines<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>global-set-key <span style="color: #4C7A90;">(</span>kbd <span style="color: #39854C;">"C-&gt;"</span><span style="color: #4C7A90;">)</span> 'mc/mark-next-like-this<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>global-set-key <span style="color: #4C7A90;">(</span>kbd <span style="color: #39854C;">"C-&lt;"</span><span style="color: #4C7A90;">)</span> 'mc/mark-previous-like-this<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf16e8ee" class="outline-3">
<h3 id="orgf16e8ee">Window Navigation</h3>
<div class="outline-text-3" id="text-orgf16e8ee">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">ace-window</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> aw-keys '<span style="color: #4C7A90;">(</span>?a ?s ?d ?f ?g ?h ?j ?k ?l<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>custom-set-faces
   '<span style="color: #4C7A90;">(</span>aw-leading-char-face
     <span style="color: #787096;">(</span><span style="color: #4d9391;">(</span>t <span style="color: #a0586c;">(</span><span style="color: #4C7A90;">:inherit</span> ace-jump-face-foreground <span style="color: #4C7A90;">:height</span> 5.0<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:bind</span>
  <span style="color: #a9779c;">(</span><span style="color: #39854C;">"M-o"</span> . ace-window<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd9b5254" class="outline-3">
<h3 id="orgd9b5254">Wgrep</h3>
<div class="outline-text-3" id="text-orgd9b5254">
<p>
wgrep allows you to edit a grep buffer and apply those changes to the file buffer like sed interactively.
No need to learn sed script, just learn Emacs.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">wgrep</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f604e6" class="outline-3">
<h3 id="org7f604e6">Find file in cursor</h3>
<div class="outline-text-3" id="text-org7f604e6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">teddy-ma/find-file-under-cursor</span> <span style="color: #a9779c;">()</span>
  <span style="color: #B08C77;">"Check it the filepath under cursor is an absolute path otherwise open helm and insert the filepath."</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">let</span> <span style="color: #4C7A90;">(</span><span style="color: #787096;">(</span>file-path <span style="color: #4d9391;">(</span>thing-at-point 'filename t<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">if</span> <span style="color: #787096;">(</span>file-name-absolute-p file-path<span style="color: #787096;">)</span>
        <span style="color: #787096;">(</span>find-file-at-point file-path<span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span><span style="color: #1D6B69;">minibuffer-with-setup-hook</span> <span style="color: #4d9391;">(</span><span style="color: #1D6B69;">lambda</span> <span style="color: #a0586c;">()</span>
                                    <span style="color: #a0586c;">(</span>insert file-path<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span>
        <span style="color: #4d9391;">(</span>helm-ls-git-ls<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4cba3e6" class="outline-3">
<h3 id="org4cba3e6">Goto line</h3>
<div class="outline-text-3" id="text-org4cba3e6">
<p>
Temporarily display line number when call go to line function
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>global-set-key <span style="color: #a9779c;">[</span>remap goto-line<span style="color: #a9779c;">]</span> 'goto-line-with-feedback<span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">goto-line-with-feedback</span> <span style="color: #a9779c;">()</span>
  <span style="color: #B08C77;">"Show line numbers temporarily, while prompting for the line number input"</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">unwind-protect</span>
      <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">progn</span>
        <span style="color: #787096;">(</span>display-line-numbers-mode 1<span style="color: #787096;">)</span>
        <span style="color: #787096;">(</span>goto-line <span style="color: #4d9391;">(</span>read-number <span style="color: #39854C;">"Goto line: "</span><span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span>display-line-numbers-mode -1<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
<p>
but avy-goto-line is awesome too
</p>
</div>
</div>
<div id="outline-container-orgd739cc9" class="outline-3">
<h3 id="orgd739cc9">Edit indirect</h3>
<div class="outline-text-3" id="text-orgd739cc9">
<p>
like buffer narrow but in other buffer
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">edit-indirect</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6727716" class="outline-3">
<h3 id="org6727716">Diff hl</h3>
<div class="outline-text-3" id="text-org6727716">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">diff-hl</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:hook</span>
  <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span>magit-pre-refresh . diff-hl-magit-pre-refresh<span style="color: #4C7A90;">)</span>
   <span style="color: #4C7A90;">(</span>magit-post-refresh . diff-hl-magit-post-refresh<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:init</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> diff-hl-draw-borders nil<span style="color: #a9779c;">)</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">(setq diff-hl-global-modes '(not org-mode))</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">(setq diff-hl-fringe-bmp-function 'diff-hl-fringe-bmp-from-type)</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">(setq diff-hl-global-modes (not '(image-mode org-mode)))</span>
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>global-diff-hl-mode<span style="color: #a9779c;">)</span>
  <span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6bd8dbd" class="outline-3">
<h3 id="org6bd8dbd">Praise the sun</h3>
<div class="outline-text-3" id="text-org6bd8dbd">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">solaire-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:hook</span> <span style="color: #a9779c;">(</span>after-init . solaire-global-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
</div>
