config.html
<div id="outline-container-org2c7f11d" class="outline-2">
<h2 id="org2c7f11d">Appearance</h2>
<div class="outline-text-2" id="text-org2c7f11d">
</div>
<div id="outline-container-org78ffbf1" class="outline-3">
<h3 id="org78ffbf1">Font</h3>
<div class="outline-text-3" id="text-org78ffbf1">
<p>
It works fine with windows and org table in Chinese
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">when</span> <span style="color: #a9779c;">(</span>eq system-type 'darwin<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> fonts '<span style="color: #4C7A90;">(</span><span style="color: #39854C;">"Monaco"</span> <span style="color: #39854C;">"STKaiti"</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>set-face-attribute 'default nil <span style="color: #4C7A90;">:font</span>
                      <span style="color: #4C7A90;">(</span>format <span style="color: #39854C;">"%s:pixelsize=%d"</span> <span style="color: #787096;">(</span>car fonts<span style="color: #787096;">)</span> 15<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> face-font-rescale-alist '<span style="color: #4C7A90;">(</span><span style="color: #787096;">(</span><span style="color: #39854C;">"STKaiti"</span>. 1.2<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">when</span> <span style="color: #a9779c;">(</span>eq system-type 'windows-nt<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> fonts '<span style="color: #4C7A90;">(</span><span style="color: #39854C;">"Inconsolata"</span> <span style="color: #39854C;">"&#21326;&#25991;&#26999;&#20307;"</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>set-face-attribute 'default nil <span style="color: #4C7A90;">:font</span>
                      <span style="color: #4C7A90;">(</span>format <span style="color: #39854C;">"%s:pixelsize=%d"</span> <span style="color: #787096;">(</span>car fonts<span style="color: #787096;">)</span> 20<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> face-font-rescale-alist '<span style="color: #4C7A90;">(</span><span style="color: #787096;">(</span><span style="color: #39854C;">"&#21326;&#25991;&#26999;&#20307;"</span>. 1.0<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">when</span> <span style="color: #a9779c;">(</span>eq system-type 'gnu/linux<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> fonts '<span style="color: #4C7A90;">(</span><span style="color: #39854C;">"Inconsolata"</span> <span style="color: #39854C;">"STKaiti"</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>set-face-attribute 'default nil <span style="color: #4C7A90;">:font</span>
                      <span style="color: #4C7A90;">(</span>format <span style="color: #39854C;">"%s:pixelsize=%d"</span> <span style="color: #787096;">(</span>car fonts<span style="color: #787096;">)</span> 18<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> face-font-rescale-alist '<span style="color: #4C7A90;">(</span><span style="color: #787096;">(</span><span style="color: #39854C;">"STKaiti"</span>. 1.0<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">dolist</span> <span style="color: #a9779c;">(</span>charset '<span style="color: #4C7A90;">(</span>kana han symbol cjk-misc bopomofo<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>set-fontset-font <span style="color: #4C7A90;">(</span>frame-parameter nil 'font<span style="color: #4C7A90;">)</span> charset
                    <span style="color: #4C7A90;">(</span>font-spec <span style="color: #4C7A90;">:family</span> <span style="color: #787096;">(</span>car <span style="color: #4d9391;">(</span>cdr fonts<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

</pre>
</div>

<p>
Add emoji support. This is useful when working with html.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">emojify</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8226831" class="outline-3">
<h3 id="org8226831">Emoji and icons</h3>
<div class="outline-text-3" id="text-org8226831">
<p>
Run M-x all-the-icons-install-fonts for the first time
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">all-the-icons</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>set-fontset-font t 'symbol <span style="color: #39854C;">"Apple Color Emoji"</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>set-fontset-font t 'symbol <span style="color: #39854C;">"Noto Color Emoji"</span> nil 'append<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>set-fontset-font t 'symbol <span style="color: #39854C;">"Segoe UI Emoji"</span> nil 'append<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>set-fontset-font t 'symbol <span style="color: #39854C;">"Symbola"</span> nil 'append<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
