config.org
*** Dired icons
#+begin_src emacs-lisp
  (use-package all-the-icons-dired
    :ensure t
    :config
    (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))
#+end_src
*** Info colors
#+begin_src emacs-lisp
  (use-package info-colors
    :ensure t
    :config
    (add-hook 'Info-selection-hook 'info-colors-fontify-node))
#+end_src

* Programming
** LSP
lsp mode

#+begin_src emacs-lisp
  (use-package gnu-elpa-keyring-update
    :ensure t)
#+end_src

#+begin_src emacs-lisp
  (require 'cc-mode)
  (use-package projectile
    :ensure t
    :config
    (setq projectile-mode-line-function '(lambda () (format " Proj[%s]" (projectile-project-name)))))
  (use-package yasnippet
    :ensure t)
  (use-package lsp-mode
    :ensure t)
  (use-package hydra
    :ensure t)
  (use-package lsp-ui
    :ensure t)
#+end_src
** Interface improvements
#+begin_src emacs-lisp
  (show-paren-mode 1)
#+end_src

When programming I like my editor to try to help me with keeping parentheses balanced.
#+begin_src emacs-lisp
  (use-package smartparens
    :ensure t
    :diminish
    smartparens-mode
    :hook
    (after-prog-mode . smartparens-mode))
#+end_src

Highlight parens etc. for improved readability.
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :config
    (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
#+end_src

Highlight strings which represent colours. I only want this in programming modes, and I don't want colour names to be highlighted (=x-colors=).
#+begin_src emacs-lisp
  (use-package rainbow-mode
    :ensure t
    :config
    (setq rainbow-x-colors nil))
#+end_src

Keep things indented correctly for me.
#+begin_src emacs-lisp
  (use-package aggressive-indent
    :ensure t)
#+end_src

Support editorconfig config file.
#+begin_src emacs-lisp
  (use-package editorconfig
    :ensure t
    :diminish editorconfig-mode
    :config
    (editorconfig-mode 1))
#+end_src

Format all
#+begin_src emacs-lisp
  (use-package format-all
    :ensure t)
#+end_src

underscore -> UPCASE -> CamelCase conversion of names
#+begin_src emacs-lisp
  (use-package string-inflection
    :ensure t)
#+end_src

Expand parentheses for me.
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook 'electric-pair-mode)
#+end_src

Smart dash guesses _ vs - depending on context.
#+begin_src emacs-lisp
  (use-package smart-dash
    :ensure t
    :config
    (add-hook 'python-mode-hook 'smart-dash-mode))
#+end_src

