config.html
<div id="outline-container-orga29a56a" class="outline-4">
<h4 id="orga29a56a">Dired icons</h4>
<div class="outline-text-4" id="text-orga29a56a">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">all-the-icons-dired</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-hook 'dired-mode-hook 'all-the-icons-dired-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd5625d5" class="outline-4">
<h4 id="orgd5625d5">Info colors</h4>
<div class="outline-text-4" id="text-orgd5625d5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">info-colors</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-hook 'Info-selection-hook 'info-colors-fontify-node<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb64d312" class="outline-2">
<h2 id="orgb64d312">Programming</h2>
<div class="outline-text-2" id="text-orgb64d312">
</div>
<div id="outline-container-orgb96e148" class="outline-3">
<h3 id="orgb96e148">LSP</h3>
<div class="outline-text-3" id="text-orgb96e148">
<p>
lsp mode
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">gnu-elpa-keyring-update</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">require</span> '<span style="color: #845A84;">cc-mode</span><span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">projectile</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> projectile-mode-line-function '<span style="color: #4C7A90;">(</span>lambda <span style="color: #787096;">()</span> <span style="color: #787096;">(</span>format <span style="color: #39854C;">" Proj[%s]"</span> <span style="color: #4d9391;">(</span>projectile-project-name<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">yasnippet</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">lsp-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">hydra</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">lsp-ui</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org119f7b5" class="outline-3">
<h3 id="org119f7b5">Interface improvements</h3>
<div class="outline-text-3" id="text-org119f7b5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>show-paren-mode 1<span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
When programming I like my editor to try to help me with keeping parentheses balanced.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">smartparens</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span>
  smartparens-mode
  <span style="color: #4C7A90;">:hook</span>
  <span style="color: #a9779c;">(</span>after-prog-mode . smartparens-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Highlight parens etc. for improved readability.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">rainbow-delimiters</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-hook 'prog-mode-hook 'rainbow-delimiters-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Highlight strings which represent colours. I only want this in programming modes, and I don't want colour names to be highlighted (<code>x-colors</code>).
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">rainbow-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> rainbow-x-colors nil<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Keep things indented correctly for me.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">aggressive-indent</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Support editorconfig config file.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">editorconfig</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span> editorconfig-mode
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>editorconfig-mode 1<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Format all
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">format-all</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
underscore -&gt; UPCASE -&gt; CamelCase conversion of names
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">string-inflection</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Expand parentheses for me.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>add-hook 'prog-mode-hook 'electric-pair-mode<span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Smart dash guesses _ vs - depending on context.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">smart-dash</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-hook 'python-mode-hook 'smart-dash-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
