config.html

<div id="outline-container-org87c24d3" class="outline-3">
<h3 id="org87c24d3">Project management</h3>
<div class="outline-text-3" id="text-org87c24d3">
<p>
Projectile handles folders which are in version control.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">projectile</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>projectile-mode +1<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>define-key projectile-mode-map <span style="color: #4C7A90;">(</span>kbd <span style="color: #39854C;">"C-c p"</span><span style="color: #4C7A90;">)</span> 'projectile-command-map<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> projectile-enable-caching t<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>projectile-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Add some extra completion options via integration with <code>counsel</code>. In particular this enables <code>C-c p SPC</code> for smart buffer / file search, and <code>C-c p s s</code> for search via <code>ag</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">counsel-projectile</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-hook 'after-init-hook 'counsel-projectile-mode<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>global-set-key <span style="color: #4C7A90;">(</span>kbd <span style="color: #39854C;">"C-c p f"</span><span style="color: #4C7A90;">)</span> 'counsel-git<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Integration with Helm
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">helm</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">helm-ag</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">helm-projectile</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>global-set-key <span style="color: #4C7A90;">(</span>kbd <span style="color: #39854C;">"C-S-f"</span><span style="color: #4C7A90;">)</span> 'helm-projectile-ag<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Integration with neotree
 modified version of <a href="https://github.com/hemmvm/dotemacs/blob/master/site-lisp/util--neotree.el">https://github.com/hemmvm/dotemacs/blob/master/site-lisp/util--neotree.el</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">neotree</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">neotree-project-tree-open</span> <span style="color: #4C7A90;">()</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">let</span> <span style="color: #787096;">(</span><span style="color: #4d9391;">(</span>project-dir <span style="color: #a0586c;">(</span><span style="color: #1D6B69;">ignore-errors</span> <span style="color: #cd9575;">(</span>projectile-project-root<span style="color: #cd9575;">)</span><span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span>
          <span style="color: #4d9391;">(</span>file-name <span style="color: #a0586c;">(</span>buffer-file-name<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span><span style="color: #1D6B69;">if</span> project-dir
          <span style="color: #4d9391;">(</span><span style="color: #1D6B69;">progn</span>
            <span style="color: #a0586c;">(</span>neotree-dir project-dir<span style="color: #a0586c;">)</span>
            <span style="color: #a0586c;">(</span>neotree-find file-name<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span>
        <span style="color: #4d9391;">(</span>neotree-find<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span>neo-global--select-window<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">neotree-project-tree-toggle</span> <span style="color: #4C7A90;">()</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">if</span> <span style="color: #787096;">(</span>neo-global--window-exists-p<span style="color: #787096;">)</span>
        <span style="color: #787096;">(</span>neotree-hide<span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span>neotree-project-tree-open<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span>global-set-key <span style="color: #4C7A90;">(</span>kbd <span style="color: #39854C;">"C-&lt;tab&gt;"</span><span style="color: #4C7A90;">)</span> 'neotree-project-tree-toggle<span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> neo-show-hidden-files t<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> neo-theme 'arrow<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> neo-window-width 35<span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">custom-neotree-enter-hide</span> <span style="color: #4C7A90;">()</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span>neotree-enter<span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">let</span> <span style="color: #787096;">(</span><span style="color: #4d9391;">(</span>current <span style="color: #a0586c;">(</span>neo-buffer--get-filename-current-line<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span><span style="color: #1D6B69;">if</span> <span style="color: #4d9391;">(</span>not <span style="color: #a0586c;">(</span><span style="color: #1D6B69;">and</span> current <span style="color: #cd9575;">(</span>file-accessible-directory-p current<span style="color: #cd9575;">)</span><span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span>
          <span style="color: #4d9391;">(</span>neotree-hide<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">custom-neotree-peek</span> <span style="color: #4C7A90;">()</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">let</span> <span style="color: #787096;">(</span><span style="color: #4d9391;">(</span>neo-window <span style="color: #a0586c;">(</span>neo-global--get-window<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span>neotree-enter<span style="color: #787096;">)</span>
      <span style="color: #787096;">(</span>select-window neo-window<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span>add-hook
   'neotree-mode-hook
   <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">lambda</span> <span style="color: #787096;">()</span>
     <span style="color: #787096;">(</span>define-key neotree-mode-map <span style="color: #4d9391;">(</span>kbd <span style="color: #39854C;">"RET"</span><span style="color: #4d9391;">)</span> 'custom-neotree-enter-hide<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span>add-hook
   'neotree-mode-hook
   <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">lambda</span> <span style="color: #787096;">()</span>
     <span style="color: #787096;">(</span>define-key neotree-mode-map <span style="color: #4d9391;">(</span>kbd <span style="color: #39854C;">"TAB"</span><span style="color: #4d9391;">)</span> 'custom-neotree-peek<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgca5177d" class="outline-3">
<h3 id="orgca5177d">Fuzzy search</h3>
<div class="outline-text-3" id="text-orgca5177d">
<p>
<code>fzf</code> is a fuzzy file finder which is very quick.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">fzf</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgae719dc" class="outline-3">
<h3 id="orgae719dc">Deadgrep</h3>
<div class="outline-text-3" id="text-orgae719dc">
<p>
You can now edit files directly from results buffers with M-x deadgrep-edit-mode.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">deadgrep</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
