config.html
<div id="outline-container-org8d64505" class="outline-3">
<h3 id="org8d64505">Open File with Line Number</h3>
<div class="outline-text-3" id="text-org8d64505">
<p>
Open files and goto lines like we see from g++ etc. i.e. Gemfile:12
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defadvice</span> <span style="color: #4C7A90;">find-file</span> <span style="color: #a9779c;">(</span>around find-file-line-number
                             <span style="color: #4C7A90;">(</span>filename <span style="color: #E36B3F;">&amp;optional</span> wildcards<span style="color: #4C7A90;">)</span>
                             activate<span style="color: #a9779c;">)</span>
  <span style="color: #B08C77;">"Turn files like file.cpp:14 into file.cpp and going to the 14-th line."</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">save-match-data</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">let*</span> <span style="color: #787096;">(</span><span style="color: #4d9391;">(</span>matched <span style="color: #a0586c;">(</span>string-match <span style="color: #39854C;">"^</span><span style="color: #39854C; font-weight: bold;">\\</span><span style="color: #39854C; font-weight: bold;">(</span><span style="color: #39854C;">.*</span><span style="color: #39854C; font-weight: bold;">\\</span><span style="color: #39854C; font-weight: bold;">)</span><span style="color: #39854C;">:</span><span style="color: #39854C; font-weight: bold;">\\</span><span style="color: #39854C; font-weight: bold;">(</span><span style="color: #39854C;">[0-9]+</span><span style="color: #39854C; font-weight: bold;">\\</span><span style="color: #39854C; font-weight: bold;">)</span><span style="color: #39854C;">:?$"</span> filename<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span>
           <span style="color: #4d9391;">(</span>line-number <span style="color: #a0586c;">(</span><span style="color: #1D6B69;">and</span> matched
                             <span style="color: #cd9575;">(</span>match-string 2 filename<span style="color: #cd9575;">)</span>
                             <span style="color: #cd9575;">(</span>string-to-number <span style="color: #5D8272;">(</span>match-string 2 filename<span style="color: #5D8272;">)</span><span style="color: #cd9575;">)</span><span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span>
           <span style="color: #4d9391;">(</span>filename <span style="color: #a0586c;">(</span><span style="color: #1D6B69;">if</span> matched <span style="color: #cd9575;">(</span>match-string 1 filename<span style="color: #cd9575;">)</span> filename<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #787096;">)</span>
      ad-do-it
      <span style="color: #787096;">(</span><span style="color: #1D6B69;">when</span> line-number
        <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">goto-line is for interactive use</span>
        <span style="color: #4d9391;">(</span>goto-char <span style="color: #a0586c;">(</span>point-min<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span>
        <span style="color: #4d9391;">(</span>forward-line <span style="color: #a0586c;">(</span>1- line-number<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org92a388c" class="outline-3">
<h3 id="org92a388c">Jump to source</h3>
<div class="outline-text-3" id="text-org92a388c">
<p>
Individual language packages often support IDE features like jump to source, but <code>dumb-jump</code> attempts to support many languages by simple searching.
It's quite effective even with dynamic libraries like JS and Python.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">dumb-jump</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span> dumb-jump-mode
  <span style="color: #4C7A90;">:bind</span> <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-M-g"</span> . dumb-jump-go<span style="color: #4C7A90;">)</span>
         <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-M-p"</span> . dumb-jump-back<span style="color: #4C7A90;">)</span>
         <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-M-q"</span> . dumb-jump-quick-look<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0026bab" class="outline-3">
<h3 id="org0026bab">Git</h3>
<div class="outline-text-3" id="text-org0026bab">
<p>
Magit is an awesome interface to git. Summon it with `C-x g`.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">magit</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-hook 'magit-mode-hook <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">lambda</span> <span style="color: #787096;">()</span> <span style="color: #787096;">(</span>magit-delta-mode +1<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:bind</span> <span style="color: #a9779c;">(</span><span style="color: #39854C;">"C-x g"</span> . magit-status<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Display line changes in gutter based on git history. Enable it everywhere.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">git-gutter</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span> git-gutter-mode
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>global-git-gutter-mode 't<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Magit Delta
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">magit-delta</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
TimeMachine lets us step through the history of a file as recorded in git.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">git-timemachine</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
bind <code>M-p -</code> to list all git repos in some folder
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> magit-repository-directories '<span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"</span><span style="color: #C5882C;">\</span><span style="color: #39854C;">~/code"</span> . 4<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">magit-status-with-prefix-arg</span> <span style="color: #a9779c;">()</span>
  <span style="color: #B08C77;">"Call `magit-status` with a prefix."</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">let</span> <span style="color: #4C7A90;">(</span><span style="color: #787096;">(</span>current-prefix-arg '<span style="color: #4d9391;">(</span>4<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span>call-interactively #'magit-status<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span>global-set-key <span style="color: #a9779c;">(</span>kbd <span style="color: #39854C;">"M-p p"</span><span style="color: #a9779c;">)</span> 'magit-status-with-prefix-arg<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
