config.html
<div id="outline-container-org351eae9" class="outline-3">
<h3 id="org351eae9">Syntax checking</h3>
<div class="outline-text-3" id="text-org351eae9">
<p>
<code>Flycheck</code> is a general syntax highlighting framework which other packages hook into. It's an improvment on the built in <code>flymake</code>.
</p>

<p>
Setup is pretty simple - we just enable globally and turn on a custom eslint function, and also add a custom checker for proselint.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">flycheck</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-hook 'after-init-hook 'global-flycheck-mode<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>add-to-list 'flycheck-checkers 'proselint<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq-default</span> flycheck-highlighting-mode 'lines<span style="color: #a9779c;">)</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">Define fringe indicator / warning levels</span>
  <span style="color: #a9779c;">(</span>define-fringe-bitmap 'flycheck-fringe-bitmap-ball
    <span style="color: #4C7A90;">(</span>vector #b00000000
            #b00000000
            #b00000000
            #b00000000
            #b00000000
            #b00000000
            #b00000000
            #b00011100
            #b00111110
            #b00111110
            #b00111110
            #b00011100
            #b00000000
            #b00000000
            #b00000000
            #b00000000
            #b00000000<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>flycheck-define-error-level 'error
    <span style="color: #4C7A90;">:severity</span> 2
    <span style="color: #4C7A90;">:overlay-category</span> 'flycheck-error-overlay
    <span style="color: #4C7A90;">:fringe-bitmap</span> 'flycheck-fringe-bitmap-ball
    <span style="color: #4C7A90;">:fringe-face</span> 'flycheck-fringe-error<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>flycheck-define-error-level 'warning
    <span style="color: #4C7A90;">:severity</span> 1
    <span style="color: #4C7A90;">:overlay-category</span> 'flycheck-warning-overlay
    <span style="color: #4C7A90;">:fringe-bitmap</span> 'flycheck-fringe-bitmap-ball
    <span style="color: #4C7A90;">:fringe-face</span> 'flycheck-fringe-warning<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>flycheck-define-error-level 'info
    <span style="color: #4C7A90;">:severity</span> 0
    <span style="color: #4C7A90;">:overlay-category</span> 'flycheck-info-overlay
    <span style="color: #4C7A90;">:fringe-bitmap</span> 'flycheck-fringe-bitmap-ball
    <span style="color: #4C7A90;">:fringe-face</span> 'flycheck-fringe-info<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8f33427" class="outline-3">
<h3 id="org8f33427">Autocomplete</h3>
<div class="outline-text-3" id="text-org8f33427">
<p>
Company mode provides good autocomplete options. Perhaps I should add company-quickhelp for documentation (<a href="https://github.com/expez/company-quickhelp">https://github.com/expez/company-quickhelp</a>)?
It would also be good to improve integration with yasnippet as I don't feel I'm making the best use there.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">company</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-hook 'after-init-hook 'global-company-mode<span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> company-idle-delay t<span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">company-anaconda</span>
    <span style="color: #4C7A90;">:ensure</span> t
    <span style="color: #4C7A90;">:config</span>
    <span style="color: #4C7A90;">(</span>add-to-list 'company-backends 'company-anaconda<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
I don't want suggestions from open files / buffers to be automatically lowercased as these are often camelcase function names.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> company-dabbrev-downcase nil<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org584e653" class="outline-3">
<h3 id="org584e653">Snippets</h3>
<div class="outline-text-3" id="text-org584e653">
<p>
Type the shortcut and press <code>TAB</code> to complete, or <code>M-/</code> to autosuggest a snippet.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">yasnippet</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span> yas-minor-mode
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-to-list 'yas-snippet-dirs <span style="color: #39854C;">"~/.emacs.d/snippets"</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>yas-global-mode 1<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>global-set-key <span style="color: #4C7A90;">(</span>kbd <span style="color: #39854C;">"M-/"</span><span style="color: #4C7A90;">)</span> 'company-yasnippet<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #7c878a;">;;</span><span style="color: #7c878a;">http://ergoemacs.org/emacs/yasnippet_templates_howto.html</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">yasnippet-snippets</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2642280" class="outline-2">
<h2 id="org2642280">Language</h2>
<div class="outline-text-2" id="text-org2642280">
</div>
<div id="outline-container-org1e1430b" class="outline-3">
<h3 id="org1e1430b">Javascript</h3>
<div class="outline-text-3" id="text-org1e1430b">
<p>
In JS indent to 2 spaces.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq-default</span> js-indent-level 2<span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
JS2 mode improves on the built in JS mode.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">js2-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:mode</span> <span style="color: #39854C;">"\\.js\\'"</span>
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq-default</span> js2-ignored-warnings '<span style="color: #4C7A90;">(</span><span style="color: #39854C;">"msg.extra.trailing.comma"</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
<code>js2-refactor</code> supports some useful refactoring options and builds on top of <code>js2-mode</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">js2-refactor</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>js2r-add-keybindings-with-prefix <span style="color: #39854C;">"C-c C-m"</span><span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:hook</span>
  <span style="color: #a9779c;">(</span>after-js-mode . js-refactor-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
RJSX mode makes JSX work well.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">rjsx-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Prettier-js autoformats JS code - much like `gofmt` - and we hook it into JS2 and RJSX modes.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">prettier-js</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> prettier-js-args '<span style="color: #4C7A90;">(</span>
                           <span style="color: #39854C;">"--trailing-comma"</span> <span style="color: #39854C;">"es5"</span>
                           <span style="color: #39854C;">"--single-quote"</span> <span style="color: #39854C;">"true"</span>
                           <span style="color: #39854C;">"--print-width"</span> <span style="color: #39854C;">"100"</span>
                           <span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:hook</span>
  <span style="color: #a9779c;">(</span>after-js2-mode . prettier-js-mode<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>after-rjsx-mode . prettier-js-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org32f33bd" class="outline-3">
<h3 id="org32f33bd">Yaml</h3>
<div class="outline-text-3" id="text-org32f33bd">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">yaml-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0069b68" class="outline-3">
<h3 id="org0069b68">Toml</h3>
<div class="outline-text-3" id="text-org0069b68">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">toml-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
