config.org
** Markdown
Markdown support isn't built into Emacs, add it with =markdown-mode=.
#+begin_src emacs-lisp
  (use-package markdown-mode
    :ensure t
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init (setq markdown-command "multimarkdown"))
#+end_src

** Lua
#+begin_src emacs-lisp
  (use-package lua-mode
    :ensure t)
#+end_src
** Haskell
Install haskell mode.
#+begin_src emacs-lisp
  (use-package haskell-mode
    :ensure t)
#+end_src

Code formatting is easier with =hindent=.
#+begin_src emacs-lisp
  (use-package hindent
    :ensure t)
#+end_src

** Elixir
Elixir highlighting is not built into emacs at present. Elixir-mode gives all the usual niceties, and alchemist improves interaction with tools like =iex=, =mix= and =elixir-format=.

#+begin_src emacs-lisp
  (use-package elixir-mode
    :ensure t)
  (use-package alchemist
    :ensure t)
#+end_src
** Ruby
#+begin_src emacs-lisp
  (use-package rake
    :ensure t)

  (use-package robe
    :ensure t
    :diminish
    :hook
    (after-ruby-mode . robe-mode))

  (use-package ruby-hash-syntax
    :ensure t
    :diminish
    :hook
    (after-ruby-mode . ruby-hash-syntax))

  (use-package rubocop
    :ensure t
    :diminish
    :hook
    (after-ruby-mode . rubocop-mode))

  (use-package haml-mode
    :ensure t)

  (use-package minitest
    :ensure t)
#+end_src
** Rails
#+begin_src emacs-lisp
  (defun run-rails-test-at-point ()
    (interactive)
    (compile (format "bundle exec rails test %s:%s" (expand-file-name (buffer-file-name))  (line-number-at-pos))))

  (defun run-rails-test-file ()
    (interactive)
    (compile (format "bundle exec rails test %s" (expand-file-name (buffer-file-name)))))
#+end_src
** C
Emacs has a great built in C/C++ mode, but we can improve on it with =irony-mode= for code completion via =libclang=.

#+begin_src emacs-lisp
  (use-package irony
    :ensure t
    :hook (c-mode . irony-mode))
#+end_src

Add company mode support.
#+begin_src emacs-lisp
  (use-package company-irony
    :ensure t
    :config
    (add-to-list 'company-backends 'company-irony))
#+end_src

Add flycheck support.
#+begin_src emacs-lisp
  (use-package flycheck-irony
    :ensure t
    :hook (flycheck-mode . flycheck-irony-setup))
#+end_src
** Rust
#+begin_src emacs-lisp
  (use-package rust-mode
    :ensure t )
#+end_src
** Web mode                                                     :@dependent:
Web mode handles html/css/js.
#+begin_src emacs-lisp
  (use-package web-mode
    :ensure t
    :mode (("\\.html\\'" . web-mode)
           ("\\.erb\\'" . web-mode))
    :config
    (setq web-mode-markup-indent-offset 2))
#+end_src

Web beautify prettifies html / css / js using js-beautify - install with =npm install -g js-beautify=.
#+begin_src emacs-lisp
  (use-package web-beautify
    :ensure t
    :bind (:map web-mode-map
                ("C-c b" . web-beautify-html)
                :map js2-mode-map
                ("C-c b" . web-beautify-js)))
#+end_src

HTML preview
#+begin_src emacs-lisp
  (use-package impatient-mode
    :ensure t)
#+end_src
* Org
