config.html
<div id="outline-container-org8c4f3df" class="outline-3">
<h3 id="org8c4f3df">Markdown</h3>
<div class="outline-text-3" id="text-org8c4f3df">
<p>
Markdown support isn't built into Emacs, add it with <code>markdown-mode</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">markdown-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:commands</span> <span style="color: #a9779c;">(</span>markdown-mode gfm-mode<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:mode</span> <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"README\\.md\\'"</span> . gfm-mode<span style="color: #4C7A90;">)</span>
         <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"\\.md\\'"</span> . markdown-mode<span style="color: #4C7A90;">)</span>
         <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"\\.markdown\\'"</span> . markdown-mode<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:init</span> <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> markdown-command <span style="color: #39854C;">"multimarkdown"</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb9c192" class="outline-3">
<h3 id="orgdb9c192">Lua</h3>
<div class="outline-text-3" id="text-orgdb9c192">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">lua-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd975424" class="outline-3">
<h3 id="orgd975424">Haskell</h3>
<div class="outline-text-3" id="text-orgd975424">
<p>
Install haskell mode.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">haskell-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Code formatting is easier with <code>hindent</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">hindent</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf508138" class="outline-3">
<h3 id="orgf508138">Elixir</h3>
<div class="outline-text-3" id="text-orgf508138">
<p>
Elixir highlighting is not built into emacs at present. Elixir-mode gives all the usual niceties, and alchemist improves interaction with tools like <code>iex</code>, <code>mix</code> and <code>elixir-format</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">elixir-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">alchemist</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8f34fc6" class="outline-3">
<h3 id="org8f34fc6">Ruby</h3>
<div class="outline-text-3" id="text-org8f34fc6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">rake</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">robe</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span>
  <span style="color: #4C7A90;">:hook</span>
  <span style="color: #a9779c;">(</span>after-ruby-mode . robe-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">ruby-hash-syntax</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span>
  <span style="color: #4C7A90;">:hook</span>
  <span style="color: #a9779c;">(</span>after-ruby-mode . ruby-hash-syntax<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">rubocop</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span>
  <span style="color: #4C7A90;">:hook</span>
  <span style="color: #a9779c;">(</span>after-ruby-mode . rubocop-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">haml-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">minitest</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd374a65" class="outline-3">
<h3 id="orgd374a65">Rails</h3>
<div class="outline-text-3" id="text-orgd374a65">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">run-rails-test-at-point</span> <span style="color: #a9779c;">()</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>compile <span style="color: #4C7A90;">(</span>format <span style="color: #39854C;">"bundle exec rails test %s:%s"</span> <span style="color: #787096;">(</span>expand-file-name <span style="color: #4d9391;">(</span>buffer-file-name<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span>  <span style="color: #787096;">(</span>line-number-at-pos<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">run-rails-test-file</span> <span style="color: #a9779c;">()</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">interactive</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>compile <span style="color: #4C7A90;">(</span>format <span style="color: #39854C;">"bundle exec rails test %s"</span> <span style="color: #787096;">(</span>expand-file-name <span style="color: #4d9391;">(</span>buffer-file-name<span style="color: #4d9391;">)</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga5d57c0" class="outline-3">
<h3 id="orga5d57c0">C</h3>
<div class="outline-text-3" id="text-orga5d57c0">
<p>
Emacs has a great built in C/C++ mode, but we can improve on it with <code>irony-mode</code> for code completion via <code>libclang</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">irony</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:hook</span> <span style="color: #a9779c;">(</span>c-mode . irony-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Add company mode support.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">company-irony</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-to-list 'company-backends 'company-irony<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Add flycheck support.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">flycheck-irony</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:hook</span> <span style="color: #a9779c;">(</span>flycheck-mode . flycheck-irony-setup<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeec3a15" class="outline-3">
<h3 id="orgeec3a15">Rust</h3>
<div class="outline-text-3" id="text-orgeec3a15">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">rust-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t <span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf1e437f" class="outline-3">
<h3 id="orgf1e437f">Web mode</h3>
<div class="outline-text-3" id="text-orgf1e437f">
<p>
Web mode handles html/css/js.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">web-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:mode</span> <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"\\.html\\'"</span> . web-mode<span style="color: #4C7A90;">)</span>
         <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"\\.erb\\'"</span> . web-mode<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> web-mode-markup-indent-offset 2<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Web beautify prettifies html / css / js using js-beautify - install with <code>npm install -g js-beautify</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">web-beautify</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:bind</span> <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">:map</span> web-mode-map
              <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-c b"</span> . web-beautify-html<span style="color: #4C7A90;">)</span>
              <span style="color: #4C7A90;">:map</span> js2-mode-map
              <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"C-c b"</span> . web-beautify-js<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
HTML preview
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">impatient-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
</div>
