config.org
** General settings.
https://www.gnu.org/software/emacs/refcards/pdf/orgcard.pdf

#+begin_src emacs-lisp
  (use-package org
    :ensure t
    :diminish org-indent-mode
    :config
    (setq org-startup-indented 'f)
    (setq org-special-ctrl-a/e 't)
    (setq org-startup-folded t)
    (setq org-hide-emphasis-markers nil)
    (setq org-src-tab-acts-natively t)
    (setq org-src-fontify-natively t)
    (setq org-src-window-setup 'current-window)
    (setq browse-url-browser-function 'browse-url-generic
          browse-url-generic-program "Chromium")
    (setq org-file-apps
          '((auto-mode . emacs)
            ("\\.x?html?\\'" . "Chromium %s")))
    (setq org-ellipsis " ▾")
    ;; org-ellipsis not shown in heading when git-gutter-fringe-mode is active
    ;; https://lccambiaghi.github.io/vanilla-emacs/readme.html#org948c5b0
    ;; org-ellipsis "⤵"
    ;; org-ellipsis "▼"
    ;; org-ellipsis "..."
    ;;  org-ellipsis " ↴
    (add-hook 'org-mode-hook (lambda ()
                               "Beautify Org Checkbox Symbol"
                               (push '("[ ]" . "☐" ) prettify-symbols-alist)
                               (push '("[X]" . "☑" ) prettify-symbols-alist)
                               (push '("[-]" . "❍" ) prettify-symbols-alist)
                               (prettify-symbols-mode))))

  ;; (setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "»") ("#+END_SRC" . "«")("#+begin_src" . "»") ("#+end_src" . "«") ("lambda"  . "λ") ("->" . "→") ("->>" . "↠")))
#+end_src

** Easy open common files
use ~C+x r j~ to jump to register, http://sachachua.com/blog/2015/02/learn-take-notes-efficiently-org-mode/

#+begin_src emacs-lisp
  (set-register ?b (cons 'file "~/Documents/org/blog.org"))
  (set-register ?t (cons 'file "~/Documents/org/todo.org"))
  (set-register ?n (cons 'file "~/Documents/org/note.org"))
  (set-register ?r (cons 'file "~/Documents/org/roam/index.org"))
#+end_src
** Org bullets
#+begin_src emacs-lisp
   (use-package org-bullets
     :ensure t
     :hook (org-mode . org-bullets-mode))
#+end_src
** Center org buffers
#+begin_src emacs-lisp
  (defun teddy-ma/org-mode-visual-fill ()
    (setq visual-fill-column-width 120
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :ensure t
    :hook (org-mode . teddy-ma/org-mode-visual-fill))
#+end_src
** Task todo stages
#+begin_src emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO" "DOING" "|" "DONE" "BLOCKED")))

  (use-package hl-todo
    :ensure t
    :hook ((prog-mode org-mode) . teddy-ma/hl-todo-init)
    :init
    (defun teddy-ma/hl-todo-init ()
      (setq-local hl-todo-keyword-faces '(("TODO" . "#ff9977")
                                          ("DOING" . "#ffcc0c")
                                          ("DONE" . "#44bc44")
                                          ("BLOCKED" . "#003366")
                                          ))
      (hl-todo-mode))
    )
#+end_src

