config.html
<div id="outline-container-org6c5390f" class="outline-2">
<h2 id="org6c5390f">Org</h2>
<div class="outline-text-2" id="text-org6c5390f">
</div>
<div id="outline-container-org245e679" class="outline-3">
<h3 id="org245e679">General settings.</h3>
<div class="outline-text-3" id="text-org245e679">
<p>
<a href="https://www.gnu.org/software/emacs/refcards/pdf/orgcard.pdf">https://www.gnu.org/software/emacs/refcards/pdf/orgcard.pdf</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">org</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span> org-indent-mode
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-startup-indented 'f<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-special-ctrl-a/e 't<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-startup-folded t<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-hide-emphasis-markers nil<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-src-tab-acts-natively t<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-src-fontify-natively t<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-src-window-setup 'current-window<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> browse-url-browser-function 'browse-url-generic
        browse-url-generic-program <span style="color: #39854C;">"Chromium"</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-file-apps
        '<span style="color: #4C7A90;">(</span><span style="color: #787096;">(</span>auto-mode . emacs<span style="color: #787096;">)</span>
          <span style="color: #787096;">(</span><span style="color: #39854C;">"\\.x?html?\\'"</span> . <span style="color: #39854C;">"Chromium %s"</span><span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-ellipsis <span style="color: #39854C;">" &#9662;"</span><span style="color: #a9779c;">)</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">org-ellipsis not shown in heading when git-gutter-fringe-mode is active</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">https://lccambiaghi.github.io/vanilla-emacs/readme.html#org948c5b0</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">org-ellipsis "&#10549;"</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">org-ellipsis "&#9660;"</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">org-ellipsis "..."</span>
  <span style="color: #7c878a;">;;  </span><span style="color: #7c878a;">org-ellipsis " &#8628;</span>
  <span style="color: #a9779c;">(</span>add-hook 'org-mode-hook <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">lambda</span> <span style="color: #787096;">()</span>
                             <span style="color: #B08C77;">"Beautify Org Checkbox Symbol"</span>
                             <span style="color: #787096;">(</span><span style="color: #1D6B69;">push</span> '<span style="color: #4d9391;">(</span><span style="color: #39854C;">"[ ]"</span> . <span style="color: #39854C;">"&#9744;"</span> <span style="color: #4d9391;">)</span> prettify-symbols-alist<span style="color: #787096;">)</span>
                             <span style="color: #787096;">(</span><span style="color: #1D6B69;">push</span> '<span style="color: #4d9391;">(</span><span style="color: #39854C;">"[X]"</span> . <span style="color: #39854C;">"&#9745;"</span> <span style="color: #4d9391;">)</span> prettify-symbols-alist<span style="color: #787096;">)</span>
                             <span style="color: #787096;">(</span><span style="color: #1D6B69;">push</span> '<span style="color: #4d9391;">(</span><span style="color: #39854C;">"[-]"</span> . <span style="color: #39854C;">"&#10061;"</span> <span style="color: #4d9391;">)</span> prettify-symbols-alist<span style="color: #787096;">)</span>
                             <span style="color: #787096;">(</span>prettify-symbols-mode<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #7c878a;">;; </span><span style="color: #7c878a;">(setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "&#187;") ("#+END_SRC" . "&#171;")("#+begin_src" . "&#187;") ("#+end_src" . "&#171;") ("lambda"  . "&#955;") ("-&gt;" . "&#8594;") ("-&gt;&gt;" . "&#8608;")))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org759ac78" class="outline-3">
<h3 id="org759ac78">Easy open common files</h3>
<div class="outline-text-3" id="text-org759ac78">
<p>
use <code>C+x r j</code> to jump to register, <a href="http://sachachua.com/blog/2015/02/learn-take-notes-efficiently-org-mode/">http://sachachua.com/blog/2015/02/learn-take-notes-efficiently-org-mode/</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>set-register ?b <span style="color: #a9779c;">(</span>cons 'file <span style="color: #39854C;">"~/Documents/org/blog.org"</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>set-register ?t <span style="color: #a9779c;">(</span>cons 'file <span style="color: #39854C;">"~/Documents/org/todo.org"</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>set-register ?n <span style="color: #a9779c;">(</span>cons 'file <span style="color: #39854C;">"~/Documents/org/note.org"</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
<span style="color: #4d9391;">(</span>set-register ?r <span style="color: #a9779c;">(</span>cons 'file <span style="color: #39854C;">"~/Documents/org/roam/index.org"</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org984908c" class="outline-3">
<h3 id="org984908c">Org bullets</h3>
<div class="outline-text-3" id="text-org984908c">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">org-bullets</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:hook</span> <span style="color: #a9779c;">(</span>org-mode . org-bullets-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5df60c4" class="outline-3">
<h3 id="org5df60c4">Center org buffers</h3>
<div class="outline-text-3" id="text-org5df60c4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">teddy-ma/org-mode-visual-fill</span> <span style="color: #a9779c;">()</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> visual-fill-column-width 120
        visual-fill-column-center-text t<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>visual-fill-column-mode 1<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">visual-fill-column</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:hook</span> <span style="color: #a9779c;">(</span>org-mode . teddy-ma/org-mode-visual-fill<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f3c747" class="outline-3">
<h3 id="org7f3c747">Task todo stages</h3>
<div class="outline-text-3" id="text-org7f3c747">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> org-todo-keywords
      '<span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span>sequence <span style="color: #39854C;">"</span><span style="color: #ff9977;">TODO</span><span style="color: #39854C;">"</span> <span style="color: #39854C;">"</span><span style="color: #ffcc0c;">DOING</span><span style="color: #39854C;">"</span> <span style="color: #39854C;">"|"</span> <span style="color: #39854C;">"</span><span style="color: #44bc44;">DONE</span><span style="color: #39854C;">"</span> <span style="color: #39854C;">"</span><span style="color: #003366;">BLOCKED</span><span style="color: #39854C;">"</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">hl-todo</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:hook</span> <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span>prog-mode org-mode<span style="color: #4C7A90;">)</span> . teddy-ma/hl-todo-init<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:init</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">defun</span> <span style="color: #4C7A90;">teddy-ma/hl-todo-init</span> <span style="color: #4C7A90;">()</span>
    <span style="color: #4C7A90;">(</span><span style="color: #1D6B69;">setq-local</span> hl-todo-keyword-faces '<span style="color: #787096;">(</span><span style="color: #4d9391;">(</span><span style="color: #39854C;">"</span><span style="color: #ff9977;">TODO</span><span style="color: #39854C;">"</span> . <span style="color: #39854C;">"#ff9977"</span><span style="color: #4d9391;">)</span>
                                        <span style="color: #4d9391;">(</span><span style="color: #39854C;">"</span><span style="color: #ffcc0c;">DOING</span><span style="color: #39854C;">"</span> . <span style="color: #39854C;">"#ffcc0c"</span><span style="color: #4d9391;">)</span>
                                        <span style="color: #4d9391;">(</span><span style="color: #39854C;">"</span><span style="color: #44bc44;">DONE</span><span style="color: #39854C;">"</span> . <span style="color: #39854C;">"#44bc44"</span><span style="color: #4d9391;">)</span>
                                        <span style="color: #4d9391;">(</span><span style="color: #39854C;">"</span><span style="color: #003366;">BLOCKED</span><span style="color: #39854C;">"</span> . <span style="color: #39854C;">"#003366"</span><span style="color: #4d9391;">)</span>
                                        <span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
    <span style="color: #4C7A90;">(</span>hl-todo-mode<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
