config.org
** Drag and drop images
#+begin_src emacs-lisp
  (use-package org-download
    :ensure t
    :config
    (setq-default org-download-image-dir "~/Documents/org/assets/images")
    (setq-default org-download-timestamp "")
    (setq-default org-download-heading-lvl nil)
    (add-hook 'dired-mode-hook 'org-download-enable))
#+end_src

** Export
Do not inlclude default style since custom css will handle it

#+begin_src emacs-lisp
  (setq org-html-head-include-default-style nil
        org-html-htmlize-output-type 'css)

  ;; (use-package ox-gfm
  ;;   :ensure t
  ;;   :after ox
  ;;   :config
  ;;   (custom-set-variables '(org-export-initial-scope 'subtree)
  ;;                         '(org-export-with-toc nil)
  ;;                         '(org-export-headline-levels 4)))
#+end_src
** Babel
#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (ruby . t)
     (js .t )
     (lua .t )
     (shell . t)
     (plantuml . t)))
#+end_src
** Reveal.js
#+begin_src emacs-lisp
  (use-package ox-reveal
    :ensure t
    :config
    (setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
    (setq org-reveal-mathjax t))
#+end_src
** Org Tree Slide
C-x-n-s and C-x-n-w can narrow to subtree

#+begin_src emacs-lisp
  (use-package org-tree-slide
    :ensure t
    :custom
    (org-image-actual-width nil))
#+end_src

** Plantuml
#+begin_src emacs-lisp
  ;;https://www.onwebsecurity.com/configuration/use-emacs-to-create-oauth-2-0-uml-sequence-diagrams.html
  ;; tell org-mode where to find the plantuml JAR file (specify the JAR file)
  (setq org-plantuml-jar-path (expand-file-name "/usr/local/Cellar/plantuml/1.2021.4/libexec/plantuml.jar"))

  ;; automatically show the resulting image
  (add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
#+end_src
** Org Roam
#+begin_src emacs-lisp
  (use-package org-roam
    :ensure t
    :diminish org-roam-mode
    :hook
    (after-init . org-roam-mode)
    :custom
    (org-roam-directory "~/Documents/org/roam/")
    (org-roam-db-update-method 'immediate)
    (org-roam-completion-system 'ivy)
    :bind
    (:map org-roam-mode-map
          (("C-c n l" . org-roam)
           ("C-c n f" . org-roam-find-file)
           ("C-c n g" . org-roam-graph))
          :map org-mode-map
          (("C-c n i" . org-roam-insert))
          (("C-c n I" . org-roam-insert-immediate))))
#+end_src

server

#+begin_src emacs-lisp
  (use-package org-roam-server
    :ensure t
    :config
    (setq org-roam-server-host "127.0.0.1"
          org-roam-server-port 8686
          org-roam-server-authenticate nil
          org-roam-server-export-inline-images t
          org-roam-server-serve-files nil
          org-roam-server-served-file-extensions '("pdf" "mp4" "ogv")
          org-roam-server-network-poll t
          org-roam-server-network-arrows nil
          org-roam-server-network-label-truncate t
          org-roam-server-network-label-truncate-length 60
          org-roam-server-network-label-wrap-length 20))
#+end_src
** Capture
#+begin_src emacs-lisp
  (use-package org-capture
    :bind ("C-c c" . org-capture)
    :after org
    :config
    (add-to-list 'org-capture-templates
                 '("t" "Todo"  entry
                   (file "~/Documents/org/refile.org")
                   "* TODO %?" :empty-lines 0))

    (add-to-list 'org-capture-templates
                 '("n" "Note" entry
                   (file "~/Documents/org/refile.org")
                   "* %?" :empty-lines 0)))
#+end_src
