config.html

<div id="outline-container-orgd1ec5b6" class="outline-3">
<h3 id="orgd1ec5b6">Drag and drop images</h3>
<div class="outline-text-3" id="text-orgd1ec5b6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">org-download</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq-default</span> org-download-image-dir <span style="color: #39854C;">"~/Documents/org/assets/images"</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq-default</span> org-download-timestamp <span style="color: #39854C;">""</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq-default</span> org-download-heading-lvl nil<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>add-hook 'dired-mode-hook 'org-download-enable<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org45072fd" class="outline-3">
<h3 id="org45072fd">Export</h3>
<div class="outline-text-3" id="text-org45072fd">
<p>
Do not inlclude default style since custom css will handle it
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> org-html-head-include-default-style nil<span style="color: #4d9391;">)</span>
<span style="color: #7c878a;">;; </span><span style="color: #7c878a;">(use-package ox-gfm</span>
<span style="color: #7c878a;">;;   </span><span style="color: #7c878a;">:ensure t</span>
<span style="color: #7c878a;">;;   </span><span style="color: #7c878a;">:after ox</span>
<span style="color: #7c878a;">;;   </span><span style="color: #7c878a;">:config</span>
<span style="color: #7c878a;">;;   </span><span style="color: #7c878a;">(custom-set-variables '(org-export-initial-scope 'subtree)</span>
<span style="color: #7c878a;">;;                         </span><span style="color: #7c878a;">'(org-export-with-toc nil)</span>
<span style="color: #7c878a;">;;                         </span><span style="color: #7c878a;">'(org-export-headline-levels 4)))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org757f488" class="outline-3">
<h3 id="org757f488">Babel</h3>
<div class="outline-text-3" id="text-org757f488">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span>org-babel-do-load-languages
 'org-babel-load-languages
 '<span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span>emacs-lisp . t<span style="color: #4C7A90;">)</span>
   <span style="color: #4C7A90;">(</span>ruby . t<span style="color: #4C7A90;">)</span>
   <span style="color: #4C7A90;">(</span>js .t <span style="color: #4C7A90;">)</span>
   <span style="color: #4C7A90;">(</span>lua .t <span style="color: #4C7A90;">)</span>
   <span style="color: #4C7A90;">(</span>shell . t<span style="color: #4C7A90;">)</span>
   <span style="color: #4C7A90;">(</span>plantuml . t<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org81b6759" class="outline-3">
<h3 id="org81b6759">Reveal.js</h3>
<div class="outline-text-3" id="text-org81b6759">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">ox-reveal</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-reveal-root <span style="color: #39854C;">"https://cdn.jsdelivr.net/npm/reveal.js"</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-reveal-mathjax t<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9297d08" class="outline-3">
<h3 id="org9297d08">Org Tree Slide</h3>
<div class="outline-text-3" id="text-org9297d08">
<p>
C-x-n-s and C-x-n-w can narrow to subtree
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">org-tree-slide</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:custom</span>
  <span style="color: #a9779c;">(</span>org-image-actual-width nil<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org19eb28f" class="outline-3">
<h3 id="org19eb28f">Plantuml</h3>
<div class="outline-text-3" id="text-org19eb28f">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #7c878a;">;;</span><span style="color: #7c878a;">https://www.onwebsecurity.com/configuration/use-emacs-to-create-oauth-2-0-uml-sequence-diagrams.html</span>
<span style="color: #7c878a;">;; </span><span style="color: #7c878a;">tell org-mode where to find the plantuml JAR file (specify the JAR file)</span>
<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> org-plantuml-jar-path <span style="color: #a9779c;">(</span>expand-file-name <span style="color: #39854C;">"/usr/local/Cellar/plantuml/1.2021.4/libexec/plantuml.jar"</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #7c878a;">;; </span><span style="color: #7c878a;">automatically show the resulting image</span>
<span style="color: #4d9391;">(</span>add-hook 'org-babel-after-execute-hook 'org-display-inline-images<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org324bcc6" class="outline-3">
<h3 id="org324bcc6">Org Roam</h3>
<div class="outline-text-3" id="text-org324bcc6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">org-roam</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:diminish</span> org-roam-mode
  <span style="color: #4C7A90;">:hook</span>
  <span style="color: #a9779c;">(</span>after-init . org-roam-mode<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:custom</span>
  <span style="color: #a9779c;">(</span>org-roam-directory <span style="color: #39854C;">"~/Documents/org/roam/"</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>org-roam-db-update-method 'immediate<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>org-roam-completion-system 'ivy<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:bind</span>
  <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">:map</span> org-roam-mode-map
        <span style="color: #4C7A90;">(</span><span style="color: #787096;">(</span><span style="color: #39854C;">"C-c n l"</span> . org-roam<span style="color: #787096;">)</span>
         <span style="color: #787096;">(</span><span style="color: #39854C;">"C-c n f"</span> . org-roam-find-file<span style="color: #787096;">)</span>
         <span style="color: #787096;">(</span><span style="color: #39854C;">"C-c n g"</span> . org-roam-graph<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
        <span style="color: #4C7A90;">:map</span> org-mode-map
        <span style="color: #4C7A90;">(</span><span style="color: #787096;">(</span><span style="color: #39854C;">"C-c n i"</span> . org-roam-insert<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span>
        <span style="color: #4C7A90;">(</span><span style="color: #787096;">(</span><span style="color: #39854C;">"C-c n I"</span> . org-roam-insert-immediate<span style="color: #787096;">)</span><span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
server
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">org-roam-server</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-roam-server-host <span style="color: #39854C;">"127.0.0.1"</span>
        org-roam-server-port 8686
        org-roam-server-authenticate nil
        org-roam-server-export-inline-images t
        org-roam-server-serve-files nil
        org-roam-server-served-file-extensions '<span style="color: #4C7A90;">(</span><span style="color: #39854C;">"pdf"</span> <span style="color: #39854C;">"mp4"</span> <span style="color: #39854C;">"ogv"</span><span style="color: #4C7A90;">)</span>
        org-roam-server-network-poll t
        org-roam-server-network-arrows nil
        org-roam-server-network-label-truncate t
        org-roam-server-network-label-truncate-length 60
        org-roam-server-network-label-wrap-length 20<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcb5d268" class="outline-3">
<h3 id="orgcb5d268">Capture</h3>
<div class="outline-text-3" id="text-orgcb5d268">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">org-capture</span>
  <span style="color: #4C7A90;">:bind</span> <span style="color: #a9779c;">(</span><span style="color: #39854C;">"C-c c"</span> . org-capture<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:after</span> org
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-to-list 'org-capture-templates
               '<span style="color: #4C7A90;">(</span><span style="color: #39854C;">"t"</span> <span style="color: #39854C;">"Todo"</span>  entry
                 <span style="color: #787096;">(</span>file <span style="color: #39854C;">"~/Documents/org/refile.org"</span><span style="color: #787096;">)</span>
                 <span style="color: #39854C;">"* </span><span style="color: #ff9977;">TODO</span><span style="color: #39854C;"> %?"</span> <span style="color: #4C7A90;">:empty-lines</span> 0<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span>add-to-list 'org-capture-templates
               '<span style="color: #4C7A90;">(</span><span style="color: #39854C;">"n"</span> <span style="color: #39854C;">"Note"</span> entry
                 <span style="color: #787096;">(</span>file <span style="color: #39854C;">"~/Documents/org/refile.org"</span><span style="color: #787096;">)</span>
                 <span style="color: #39854C;">"* %?"</span> <span style="color: #4C7A90;">:empty-lines</span> 0<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
