config.html
<div id="outline-container-org329d6a4" class="outline-3">
<h3 id="org329d6a4">Agenda</h3>
<div class="outline-text-3" id="text-org329d6a4">
<p>
Interactive agenda in the console <a href="https://github.com/rougier/agenda">https://github.com/rougier/agenda</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">org-agenda</span>
  <span style="color: #4C7A90;">:bind</span> <span style="color: #a9779c;">(</span><span style="color: #39854C;">"C-c a"</span> . org-agenda<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-to-list 'org-agenda-files <span style="color: #39854C;">"~/Documents/org/todo.org"</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbadfded" class="outline-2">
<h2 id="orgbadfded">Extras</h2>
<div class="outline-text-2" id="text-orgbadfded">
</div>
<div id="outline-container-org202c004" class="outline-3">
<h3 id="org202c004">Writing</h3>
<div class="outline-text-3" id="text-org202c004">
<p>
<code>writegood-mode</code> highlights bad word choices and has functions for calculating readability.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">writegood-mode</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:bind</span> <span style="color: #a9779c;">(</span><span style="color: #39854C;">"C-c g"</span> . writegood-mode<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span>add-to-list 'writegood-weasel-words <span style="color: #39854C;">"actionable"</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span>abbrev-mode t<span style="color: #4d9391;">)</span>
<span style="color: #7c878a;">;; </span><span style="color: #7c878a;">~/.emacs.d/abbrev_defs</span>
</pre>
</div>

<p>
need aspell to ispell (brew install aspell)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">setq</span> ispell-program-name <span style="color: #39854C;">"aspell"</span><span style="color: #4d9391;">)</span>
</pre>
</div>

<p>
Proselint is a syntax checker for English language. This defines a custom checker which will run in texty modes.
Proselint is an external program, install it with <code>pip install proselint</code> for this to work.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">flycheck-define-checker</span> proselint
  <span style="color: #B08C77;">"A linter for prose."</span>
  <span style="color: #4C7A90;">:command</span> <span style="color: #a9779c;">(</span><span style="color: #39854C;">"proselint"</span> source-inplace<span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:error-patterns</span>
  <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span>warning line-start <span style="color: #787096;">(</span>file-name<span style="color: #787096;">)</span> <span style="color: #39854C;">":"</span> line <span style="color: #39854C;">":"</span> column <span style="color: #39854C;">": "</span>
            <span style="color: #787096;">(</span>id <span style="color: #4d9391;">(</span>one-or-more <span style="color: #a0586c;">(</span>not <span style="color: #cd9575;">(</span>any <span style="color: #39854C;">" "</span><span style="color: #cd9575;">)</span><span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #787096;">)</span>
            <span style="color: #787096;">(</span>message <span style="color: #4d9391;">(</span>one-or-more not-newline<span style="color: #4d9391;">)</span>
                     <span style="color: #4d9391;">(</span>zero-or-more <span style="color: #39854C;">"\n"</span> <span style="color: #a0586c;">(</span>any <span style="color: #39854C;">" "</span><span style="color: #a0586c;">)</span> <span style="color: #a0586c;">(</span>one-or-more not-newline<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #787096;">)</span>
            line-end<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #4C7A90;">:modes</span> <span style="color: #a9779c;">(</span>text-mode markdown-mode gfm-mode org-mode<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org26ee7f6" class="outline-3">
<h3 id="org26ee7f6">Pinyin</h3>
<div class="outline-text-3" id="text-org26ee7f6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">posframe</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>

<span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">pyim</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:demand</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">&#28608;&#27963; basedict &#25340;&#38899;&#35789;&#24211;&#65292;&#20116;&#31508;&#29992;&#25143;&#35831;&#32487;&#32493;&#38405;&#35835; README</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">pyim-basedict</span>
    <span style="color: #4C7A90;">:ensure</span> t
    <span style="color: #4C7A90;">:config</span> <span style="color: #4C7A90;">(</span>pyim-basedict-enable<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> default-input-method <span style="color: #39854C;">"pyim"</span><span style="color: #a9779c;">)</span>

  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">&#35774;&#32622; pyim &#25506;&#38024;&#35774;&#32622;&#65292;&#36825;&#26159; pyim &#39640;&#32423;&#21151;&#33021;&#35774;&#32622;&#65292;&#21487;&#20197;&#23454;&#29616; *&#26080;&#30171;* &#20013;&#33521;&#25991;&#20999;&#25442; :-)</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">&#25105;&#33258;&#24049;&#20351;&#29992;&#30340;&#20013;&#33521;&#25991;&#21160;&#24577;&#20999;&#25442;&#35268;&#21017;&#26159;&#65306;</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">1. &#20809;&#26631;&#21482;&#26377;&#22312;&#27880;&#37322;&#37324;&#38754;&#26102;&#65292;&#25165;&#21487;&#20197;&#36755;&#20837;&#20013;&#25991;&#12290;</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">2. &#20809;&#26631;&#21069;&#26159;&#27721;&#23383;&#23383;&#31526;&#26102;&#65292;&#25165;&#33021;&#36755;&#20837;&#20013;&#25991;&#12290;</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">3. &#20351;&#29992; M-j &#24555;&#25463;&#38190;&#65292;&#24378;&#21046;&#23558;&#20809;&#26631;&#21069;&#30340;&#25340;&#38899;&#23383;&#31526;&#20018;&#36716;&#25442;&#20026;&#20013;&#25991;&#12290;</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq-default</span> pyim-english-input-switch-functions
                '<span style="color: #4C7A90;">(</span>pyim-probe-dynamic-english
                  pyim-probe-isearch-mode
                  pyim-probe-program-mode
                  pyim-probe-org-structure-template<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>

  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq-default</span> pyim-punctuation-half-width-functions
                '<span style="color: #4C7A90;">(</span>pyim-probe-punctuation-line-beginning
                  pyim-probe-punctuation-after-punctuation<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>

  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">&#24320;&#21551;&#25340;&#38899;&#25628;&#32034;&#21151;&#33021;</span>
  <span style="color: #7c878a;">;;</span><span style="color: #7c878a;">(pyim-isearch-mode 1)</span>

  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">&#20351;&#29992; pupup-el &#26469;&#32472;&#21046;&#36873;&#35789;&#26694;, &#22914;&#26524;&#29992; emacs26, &#24314;&#35758;&#35774;&#32622;</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">&#20026; 'posframe, &#36895;&#24230;&#24456;&#24555;&#24182;&#19988;&#33756;&#21333;&#19981;&#20250;&#21464;&#24418;&#65292;&#19981;&#36807;&#38656;&#35201;&#29992;&#25143;</span>
  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">&#25163;&#21160;&#23433;&#35013; posframe &#21253;&#12290;</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> pyim-page-tooltip 'posframe<span style="color: #a9779c;">)</span>

  <span style="color: #7c878a;">;; </span><span style="color: #7c878a;">&#36873;&#35789;&#26694;&#26174;&#31034;5&#20010;&#20505;&#36873;&#35789;</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> pyim-page-length 5<span style="color: #a9779c;">)</span>

  <span style="color: #4C7A90;">:bind</span>
  <span style="color: #a9779c;">(</span><span style="color: #4C7A90;">(</span><span style="color: #39854C;">"M-j"</span> . pyim-convert-code-at-point<span style="color: #4C7A90;">)</span> <span style="color: #7c878a;">;</span><span style="color: #7c878a;">&#19982; pyim-probe-dynamic-english &#37197;&#21512;</span>
   <span style="color: #4C7A90;">(</span><span style="color: #39854C;">"M-;"</span> . pyim-delete-word-from-personal-buffer<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2e0186f" class="outline-3">
<h3 id="org2e0186f">PlantUML</h3>
<div class="outline-text-3" id="text-org2e0186f">
<p>
need plantuml (brew install plantuml)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">when</span> <span style="color: #a9779c;">(</span>eq system-type 'darwin<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">plantuml-mode</span>
    <span style="color: #4C7A90;">:ensure</span> t<span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span>add-to-list 'org-src-lang-modes '<span style="color: #4C7A90;">(</span><span style="color: #39854C;">"plantuml"</span> . plantuml<span style="color: #4C7A90;">)</span><span style="color: #a9779c;">)</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> org-plantuml-jar-path <span style="color: #39854C;">"/usr/local/Cellar/plantuml/1.2021.0/libexec/plantuml.jar"</span><span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org430db5f" class="outline-3">
<h3 id="org430db5f">Dictionary</h3>
<div class="outline-text-3" id="text-org430db5f">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">youdao-dictionary</span>
  <span style="color: #4C7A90;">:ensure</span> t
  <span style="color: #4C7A90;">:config</span>
  <span style="color: #a9779c;">(</span><span style="color: #1D6B69;">setq</span> url-automatic-caching t<span style="color: #a9779c;">)</span><span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org24f7018" class="outline-3">
<h3 id="org24f7018">Disk Usage</h3>
<div class="outline-text-3" id="text-org24f7018">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4d9391;">(</span><span style="color: #1D6B69;">use-package</span> <span style="color: #845A84;">disk-usage</span>
  <span style="color: #4C7A90;">:ensure</span> t<span style="color: #4d9391;">)</span>
</pre>
</div>
</div>
</div>
